ans_1 = r'''
Философия – любовь к мудрости.  Возникла Ф. 2 тыс. лет назад и включала в себя все науки, только потом пошло разделение на предметы. О происхождении ф.сформировались две концепции: мифогенная(выводит ф.из мифологии),гносеогенная(из науки).
Предметом анализа в философии становится сам человек.  Основным принципом философии является рефлексивность(отражение исследования познавательного акта).
Св-ва (принципы) ф.: <br>
1.	Рефлексивность<br>
2.	Всеобщность (в отличие от частных наук, кот. Изуч. Отдельн. Фрагменты мира, ф. изуч. Мир в целом)<br>
3.	Абстрактность (способность ф. опилировать абстракциями)<br>
Основное назначение ф. –способность выступать в качестве средства ориентации чел.в мире(навигатор). Навигатор – устройство, позв.проложить оптимальный маршрут.
Методология – способы ориентации человека в мире, способы реш.проблем.<br>
Культура – все, что создано человеком. Культура : материальная( артефакты, т.е. искусств. созд.), духовная(философия, наука, мораль, искусство, политика, право, религия).
Структура философии: онтология(учение о бытии), гносеология(учение о познании), аксиология(учение о природе и ценностях), праксеология(учение о практическом отношении человека и мира), антропология(учение о человеке), соц.философия(описывает специфические особенности общества), диалектика( учение о развитии), герменевтика (теория понимания и толкования знаний), этика(учение о нравственном отношении человека к миру) , эстетика(учение о красоте и гармонии мира) , логика(учение о нормах и законах мышления).<br>
Функции философии: мировоззренческая (с помощью философии у человека формируется мировоззрение), методологическая функция (философия вырабатывает основные методы познания окружающей действительности), гносеологическая (одна из основополагающих функций философии – имеет целью правильное и достоверное познание окружающей действительности (то есть механизм познания)), аксиологическая (соц., нравственные, эстетические ценности), социальная функция (объясняет общество, причины его возникновения, эволюцию, современное состояние, его структуру)<br>
Основная специфика философского знания заключается в его двойственности, так как оно: <br>
1. имеет очень много общего с научным знанием – предмет, методы, логико-понятийный аппарат; <br>
2. однако не является научным знанием в чистом виде.<br>
'''

ans_2 = r'''
<br>Мировоззрение – система наиболее общих взглядов на мир вцелом и месте человека в нем, его ценностей и убеждений.
<br>мировоззрение включает и синтезирует перечень интеллектуальных образований: ценности, знания, желания, взгляды, принципы, жизненные ориентиры, убеждения и т.д. 
<br>Ценности — цель, которая выступает для человека неизменной и желаемой формой восприятия. Благодаря ценностям мировоззрение приобретает духовно-практический характер, то есть любые проявления реального мира формируют духовный мир человека. Ценности разделяют мир, дают ему смысловой лад и облегчают ориентацию человека в нем.
<br>Убеждения — это главный компонент мировоззрения, который характеризирует его как форму самосознания. Это есть субъективный опыт человека, который несет в себе мотив отношения человека к миру.
<br>Функции мировоззрения:  «вписать» человека в мир, дать ему жизненные ориентиры, «нарисовать» действительность в человеческих представлениях о мире.
<br>Структура мировоззрения: мироощущуение (мир и отношение человека к нему воспроизводятся в чувственно-эмоциональной форме), мировосприятие (мир дается человеку как предметная реальность, которая каким-то образом организована и упорядочена), миропонимание (позволяет человеку определить мотивы и ориентиры в каждой жизненной ситуации; миропонимание=абстрактное мышление + теоретическое познание)
<br>     Структура мировоззрения: 
<br>•  мироощущение - чувственное знание мира; 
<br>•  мировосприятие – образное знание мира; 
<br>•  миропонимание – теоретическое знание мира; 
<br>     Мироощущение– это эмоционально-психологическая сторона мировоззрения на уровне настроений и чувств. Мировосприятие представляет собой опыт формирования познавательных образов мира с использованием наглядных представлений. Миропонимание– это познавательно-интеллектуальная сторона мировоззрения.
<br>     Мировоззрение имеет передающуюся из поколения в поколение духовную составляющую, представленную ценностями, традициями, идеалами, нормами,  идеями, потребностями.
<br>Методология - учение о методах, способах и стратегиях исследования предмета.

'''

ans_3 = '''
<br>Типы мировоззрения: мифологическое, религиозное, научное, философское.
<br>Мифология — осмысление и представление мира и чел. в фантастич. образах и сюжетах. Универсальный тип м. первобытных обществ. Неспособность провести различие между естественным и сверхестеств. Слабое развитие абстрактных понятий. Эмоц. хар-р первичного сознания. Чувственно-образная форма постижение действит-ти.
<br>Религия — форма м., объясняющая мир чел. через связь со сверъестеств. существами и выступающее как средство общения чел. с ними. Время формир-я: переход от первобыт. строя к рабовлад. обществу. Преодоление неразделимости чел. и природы. Раздвоение мира на духовное и телесное. Вера — главное средство постижения бытия. Главное — достижение единения с Богом.
<br>Философия — альтернатива мифологии и религии, исторически возникшая и первая форма систематизир. теоретич. мышления. Опора на научные знания. Стремление ставить и решать абсолют. проблемы чел. бытия. Предельно широкий уровень обобщения.
<br>Наука — систематич. объединение объективно достоверных сведений о явлениях природы и жизни чел.

'''

ans_4 = '''
<br>     Восточная философия культивирует непосредственное восприятие мира, не втискивая мысль в те жесткие логические и рационалистические формы, в которые обычно облекается философская мысль Запада. Восточными мыслителями цель жизни и жизнь не рассматриваются в отрыве друг от друга. Они не просто провозглашают истину, но одновременно стремятся указать путь к ней.
<br>     Колыбелью цивилизации был Древний Восток, и прежде всего три региона:  Ближний Восток; 
<br>Индия; Китай. 
<br>     Первые доказательства существования письменности на рубеже 4 – 3 тысячелетий до н.э.  были получены на территории Месопотамии и Египта. Первоначально человек выражал свое отношение к миру в мифах(образная картина мира, сочетающая в себе реальность и фантазию, естественное и сверхъестественное, знание и веру, мысль и эмоции). В них он пытался дать ответ на вопросы о смысле естественного порядка, о предназначении и содержании индивидуального человеческого существования. Так в «Эпосе о Гильгамеше» рассматриваются проблемы бессмертия, жизни и смерти, смысла жизни. «Эпос о Гильгамеше» – общее завещание шумеров, вавилонян и ассирийцев мировой культуре.
<br>    Однако в Месопотамии и других областях Ближнего Востока не произошло отделения науки и философии от универсального мифологического понимания мира.

'''

ans_5 = '''
<br> Философия Древней Индии возникла в середине 1 тысячелетия до н.э., когда на территории современной Индии стали формироваться государства. Древнейший памятник индийской философии– это Веды, включавшие в себя4 сборника: 
<br>1)  Ригведа         2)  Брахманы           3)  Араньяки         4)  Упанишады 
<br>   Ригведы– это знание гимнов, Брахманы– религиозные тексты, Араньяки– 
<br>нравственный кодекс для отшельников, Упанишады– это философское учение. Упанишады развивали идеи брахмана  как высшей духовной субстанции мира, атмана (души человека), сансары– концепции круговорота жизни, кармы– закона  воздаяния. Брахман– это первоначало мира, тождественное атману. Согласно концепции круговорота жизни, человеческая жизнь рассматривается как определенная форма бесконечной цепи перерождений. Закон кармы диктует постоянные включение в круговорот перерождений и детерминирует будущее рождение, которое является результатом всех деяний, предшествующих жизни. Только тот, кто совершал благие действия, жил в согласии с действующей моралью(мокшей), родится в будущей жизни как представитель высшего сословия. 
<br>     Различают три основных варны(касты, сословия): 1)  брахманы; 2)  кшатрии; 3)  вайшья. Те люди, чьи действия не были правильными, могут в будущей жизни родиться как члены низшей варны.
<br>      Для древнеиндийской философии характерно развитие в рамках определенных
<br>систем, делящихся на две большие группы: 
<br>1) ортодоксальные школы, признающие  авторитет Вед: веданта, йога, санхья, вайшешика; 
<br>2) неортодоксальные школы, не признающие авторитет Вед: джайнизм, буддизм. 
<br>    Философская школа «йога» возникла во 2 в. н.э. Основатель– Патанджами, являющийся автором
<br>Трактата «Йога-сутра». В йоге рассматриваются необходимые этапы для совершенствования души человека и перехода его к брахме. В человеке выделяют три составляющие: 
<br>•  физическое тело;   •  тонкое тело(чувство, разум, самосознание);   •  чистое сознание(душа). 
<br>    Философия йоги исходит из признания необходимости медитаций, то есть размышлений, цель которых приведение психики человека в состояние углубленности и сосредоточения, что сопровождается телесной расслабленностью и отсутствием эмоциональных проявлений, отрешенностью. Правила психологически ориентированной тренировки включают: 
<br>1) самообладание(яма), т.е. дисциплина тела; 
<br>2) овладение дыханием при определенных положениях тела(асана), т.е. дисциплина дыхания(пранаяма); 
<br>3) изоляция чувств от внешних влияний, т.е. дисциплина чувств; 
<br>4) концентрация мысли(пратьяхара); 
<br>5) медитация(дхьяна); 
<br>6) состояние отторжения(самадхи) – освобождение от телесной оболочки. 
<br>     Буддизм возник в 6 в. до н.э. в Северной Индии. Основатель–Гаутама, которого впоследствии прозвали Буддой. Правильный жизненный путь, согласно Гаутаме, отвергает
<br>крайности. Центром его учения являются 4 благородные истины: 
<br>1) существование человека неразрывно связано со страданием. Невозможность достичь желаемого– ведут к страданию; 2) причиной страдания является «жажда», т.е. сильные желания и страсти,
<br>3) устранение причин страдания связано с устранением этой «жажды»; 
<br>4) путь, ведущий к устранению этой «жажды» – это благой восьмеричный путь, 
<br>заключающийся в следующем: •  правильное суждение; •  правильное решение; •  правильная речь; •  правильная жизнь; •  правильное стремление; •  правильное внимание; •  правильное сосредоточение; •  избавление от страданий через правильное познание и достижение нирваны. 
<br>    Нирвана– это состояние полной невозмутимости, освобождение от всего, что
<br>приносит боль, отвлечение от внешнего мира(буквально– угасание). 

'''

ans_6 = '''
<br>Источниками древнекитайской философии являются 5 книг: 1)  книга песен 2)  книга истории Шудзын  3)  книга порядка Лишу 4)  книга весны и осени  5)  книга перемен 
<br>Китайская философия создает самобытное представление о человеке и мире, как созвучных реальностях. Человек возникает тогда, когда изначальный эфир(ци) делится на два противоположных начала Инь и Ян(свет и тьму). Мужской дух Ян стал управлять небом, а женский Инь– землей. Своим появлением человек призван преодолеть эту «расколотость» мира, ибо объединяет в себе темное и светлое, мужское и женское, активное и пассивное, покой и движение, твердость и мягкость. Вместе с небом и землей человечество составляет великую триаду, каждый член которой порождает свой особый мир, а вместе– всю тьму вещей. Меж небом и землей человек драгоценее всего, но мир создан не ради человека. Человек лишь предпоследнее звено развития мира. Человек– это микрокосм, который связан с космосом тысячей незримых связей, и они постоянно влияют друг на друга. Отсюда неизменное чувство ответственности за свои действия на высшем космическом уровне. 
<br>      В философии Древнего Китая выделяют три фундаментальных числа: 
<br>2 – Инь и Ян,               3 – небо, человек, земля,                          5 – огонь, земля, вода, дерево, металл. 
<br>В воображаемом пространстве времени человек занимает несколько необычную позицию: он обращен к прошлому, а к будущему повернут спиной. Будущее не привлекает особого внимания, ведь время движется по кругу, и все возвращается к своему первоистоку. Возвращается к своим истокам и каждый отдельно взятый человек. Отсюда смерть– это лишь возвращение и одновременное превращение, так как Великий гончарный круг Дао лепит из старого материала все новые формы и разбрасывает их  по Вселенной. Жизнь– это лишь сон и не нужно бояться великого «пробуждения». 
<br>Конфуций(551-479 гг. до н.э.). Конфуцию(Кун Фу-цзы) приписывают составление такой книги, как летопись «Весна и Осень». В школе Конфуция преподавались 4 дисциплины: 
<br>•  мораль;       •  язык;        •  политика;       •  литература. 
<br>     В центре его философии находятся проблемы человека и воспитания. Его занимала проблема умственного и нравственного облика человека. Он первым разработал концепцию идеального человека– Цзюнь-цзы– «благородного мужа» не по происхождению, а благодаря воспитанию в себе высоких нравственных качеств и культуры. Этот благородный человек должен обладать человечностью(Жэнь), или любовью к людям. «Для того чтобы познать новое, необходимо изучать старое. Учение без размышления бесполезно, размышление без учения опасно». 
<br>Социальные отношения являются параллелью семейных. Отношения подданного и правителя, подчиненного и начальника, такие же, как и отношения сына к отцу, младшего брата к старшему. «Правитель должен так относиться к своим подданным, а начальник к подчиненным, как отец к детям». Конфуций связывал идею общественного устройства с «исправление имен», то есть государь должен быть государем, сановник– сановником, отец– отцом, сын– сыном. 
<br>Человеческое существование не может обойтись без следующих двух принципов: 
<br>1)  помогай другим достичь того, чего бы ты сам хотел достичь; 
<br>2)  чего не желаешь себе, того не делай другим. 
<br>     Даосизм возник в 5 веке до н.э. Даосизм– это философское учение наивно-материалистического  характера.  Основателем  учения  считается  Лао-цзы. Ему приписывают составление книги, в которой описывается учение данной школы– «Дао-дэ цзин». В центре внимания даосизма– природа, космос, человек. Цель мышления– слияние человека с природой, так как он является его частью. Дао– дословно «путь», единая реальность, сверхбытие. Дао– безымянно и бесконечно, бестелесно и бесформенно. В движении оно– праотец всего сущного. Причина движения и изменения мира–  два противоположных начала: Инь и Ян. Соблюдение меры вещей(у-вэй) является для человека  главной жизненной задачей.

'''

ans_7 = '''
<br>Античная философия - совокупность философских учений, созданных в период античности, т.е. греческой и греко-римской древности.
<br>Возникновению и развитию античной философии способствовали благоприятные социально-экономические и политические условия, сложившиеся в Древней Греции: политическая свобода, развитие ремесел и торговли, активная политическая и гражданская жизнь в городах государствах (полисах) и др. Античная философия тесно связана со всеми сторонами античной культуры.
<br>До н.э. по 5 в. н.э. В развитии античной философии выделяют 4 этапа: 
<br>1) досократическая философия(7-5вв. до н.э.). 
<br>2) Классический этап, представленный преимущественно Сократом, Платоном, Аристотелем(5-4вв. до н.э.). 
<br>3) Эллинистический этап, связанный с упадком греческих городов и установлением господства Македонии(4-2 вв. до н.э.). 
<br>4) Римская философия(1в. до н.э. – 5в. н.э.). 
<br>Введение термина "философия" традиция приписывает Пифагору.
<br>   Первые материалистические учения на грани7-6 вв. до н.э. возникли в Милете. Милетская
<br>школа связана с такими именами как Фалес, Анаксимандр(ученик Фалеса), Анаксимен(ученик Анаксимандра). Фалес впервые в философии выдвинул проблему первоначала в качестве основной проблемы философии. Первоначалом всего он считал воду: из воды все возникает и в воду все возвращается. Гегель говорил, что «Фалесово положение, что вода есть абсолют или первоначало,  представляет собой начало. 
<br>      Сократ. Основная проблема его философии– проблема субъекта(человека). Сократ выдвинул лозунг: «Познай самого себя», то есть познай, кто ты есть и будь им. Философия, по Сократу, – это не умозрительное рассмотрение природы, а учение о том, как следует жить, или жизнепонимание.
<br>     Учеником Сократа был Платон. Платон(427-347 гг. до н.э.), являлся основателем первой Академии, т.е. философской школы. В этой школе изучали 4 основные дисциплины: 
<br>1) диалектику; 2) математику; 3) астрономию; 4) музыку. 
<br>Всю действительность Платон разделил на два мира: • мир идей; • материальный мир. 
<br>Платон выделял 3 части души: 1) разум; 2) воля и благородные желания; 3)  чувственность 
<br>Учеником Платона был Аристотель В 334 г. до н.э. основал первый лицей– перипатетическую философскую школу. Написал более150 трактатов. Философия – это учение о всеобщем, знание общего. Мудрость– это знание причин всех явлений. Философия делится на3 части: 1) теоретическая: метафизика, физика, математика. 2) практическая: политика, этика, риторика. 3) изобразительная: поэтика, риторика. Аристотель: «Платон мне друг, но истина дороже» и подверг критике платоновскую теорию идей.

'''

ans_8 = '''
<br>Средневековая философия хронологически охватывает период с 5 по 15 века.  Главное отличие средневекового мышления в том, что оно пронизано проблемами религии. Философия в это время становится «служанкой богословия». Основными проблемами философии в это время
<br>были следующие: •  Сотворен ли бог или он существовал вечно? •  Постижимы ли воля и намерения бога и сотворенный им мир? •  Каково место человека в мире и какова его роль в истории? •  Как сочетаются свобода воли человека и божественная необходимость? •  Как связана вера и разум? 
<br>   Выделяют два основных этапа средневековой философии: 1)  Патристика(1-6 вв.) – учение отцов церкви. Вершина патристики– Августин Блаженный(354-430). 2)  Схоластика(расцвет11-15 вв.). 
<br>Вершина схоластики– Фома Аквинский(1225-1274). 
<br>Августин Блаженный(354-430 гг. н.э.). Основные сочинения: «Исповедь», «О граде Божьем». Августин был убежден, что многие люди живут, не понимая себя. Каждый человек представляет для себя вопрос, который необходимо решить Августин пытался философски обосновать первенство веры над разумом: «Все человеческое познание имеет 2 источника: 1)  опыт, 2)  другой источник заключен в приобретении знаний от других людей, это опосредованное познание и есть вера. 
<br>Фома Аквинский(1225-1274) является основателем томизма – учения, использующего рациональные аргументы для обоснования бытия бога. Аквинский соединил христианство с учением Аристотеля. Он утверждал, что человека нужно изучать целиком, то есть в единстве души и тела. Тело – это не человек, также дух (приведение) – не человек. Человек– это существо промежуточное между животным и ангелом. Человек– это личность. Природа– не злое, а доброе начало, так как ее создал бог Основные идеи средневековой философии: •  Принцип абсолютной личности, то есть Бога. 
<br>•  Теоцентризм– принцип,  согласно  которому,  источником  всякого  бытия, 
<br>блага и красоты является Бог. •  Монотеизм– Бог един и уникален. •  Креационизм – это учение о сотворении мира Богом из ничего. •  Провиденциализм– понимание истории как осуществления, заранее предусмотренного Богом, плана спасения человечества. •  Средневековый антропоцентризм– человек не просто микрокосм, а повелитель всего, созданного для него. Человек обладает не двумя, а тремя измерениями: тело, душа, духовность. •  Номинализм и реализм в истолковании природы общих понятий. •  Тенденция к назидательности и учительству, схоластический характер средневековой философии(школьной философии).


'''

ans_9 = '''
<br>Эпоха Возрождения– это период перехода от средневековья к Новому времени. Она охватывает период с14 по16 века. Возрождение связано с новым расцветом античной культуры, науки  и философии. Философское творчество разворачивается в форме «осовременивающего воспоминания». Основные идеи философии данной эпохи: 
<br>•  Антропоцентризм: основное внимание направлено не на Бога, а на человека. 
<br>•  Гуманизм: стремление к человечности, к созданию условий для достойной человека жизни, признание человека личностью, его права на творчество, свободу и счастье. Гуманизм начинается тогда, когда человек начинает рассуждать о самом себе, о смысле и цели своего бытия. 
<br>•  Постулирование творческой сущности человека. Человек никому не подражает: ни Богу, ни природе. Он сам по себе деятелен. Он творит в основном рукотворно, ремесленно. 
<br>•  Личностно-материальное понимание мира, то есть все существующее понимается в проекции на человека при акценте на его телесной сущности. 
<br>•  Идея доминирования эстетического понимания мира над моральными и научными представлениями. 
<br>•  Антисхоластическая направленность, которая проявилась в стремлении развенчать мнимые авторитеты и пропагандируемые ими догмы. С этой точки зрения особое значение имела Реформация– движение в пользу религиозных реформ(Ян Гус, Мартин Лютер, Кальвин, Т.Мюнцер)
<br>•  Натурфилософское понимание мира, сочетающее в себе материализм и диалектику. Это означало естественный, «натуральный» подход к познанию законов мироустройства, противостоящего книжному знанию схоластики(Николай Кузанский). 
<br>•  Пантеизм– учение, согласно которому Бог растворен в природе и присутствует в ней, как необходимость, целесообразность, закон(Д. Бруно). 
<br>Яркими  представителями  эпохи  Возрождения  являются  Мишель  Монтень(«Опыты»),Т. Мор («Утопия»), Т. Кампанелла(«Город Солнца»), Ф. Петрарка, Роджер Бэкон.

'''

ans_10 = '''
<br>Главная черта времени - проблемы гносеологии; вопросы познания; поиск основного метода познания мира. Время зарождения и утверждения нового обществ. строя — буржуазного (новые ценности). Перед обществом - проблема разработки методов изучения природы. Два противоп. направления: эмпиризм и рационализм.
<br>Эмпиризм: единств. источник познания — чувств. опыт, процесс познания начинается с ощущений. Представители: Ф. Бэкон, Дж. Локк, Томас Гоббс. 
<br>Томас Гоббс(1588-1679) в своем сочинении «Левиафан» развивал учение о государстве. «Все люди одинаковы от природы и стремятся к хорошей жизни, но так как от природы люди равны, то ни один не хочет уступить другому».
<br>Ф. Бэкон - создал индуктивный метод; "знание - сила". Только знание позволит человеку покорить природу. Философия– это наука о реальном мире, основанная на опытном познании. Различал 2 вида опытов: плодоносные (принесение непосредственной пользы чел.) и светоносные (ведут к познанию законов природы).
<br>Рационализм: истина может быть выведена только из разума. Определяющая роль разума в деятельности людей. Представители: Декарт, Спиноза, Лейбниц. 
<br>Р. Декарт. Дуализм — сущ-е 2 независимых друг от друга субстанций: материальной (протяженность) и духовной (мышление). Все в природе подчинено сугубо механич. законам. Философия – это познание истины по ее первопричинам
<br>Сенсуализм - учение в гносеологии, признающее ощущение единственным источником познания.
<br>Крупные философы-сенсуалисты: Протагор — древнегреческий философ, один из старших софистов, Эпикур, Джон Локк, Этьен Бонно де Кондильяк

'''

ans_11 = '''
<br>В конце XVII - н. XIX  вв.  Германия  приближалась  к  буржуазной  революции. Важную  роль  в  формировании НКФ сыграли достижения естествознания и общественных наук.
<br>Кант   -основоположник   нем.   классич.   идеализма.   Разработал    концепцию происхождения солнечной системы из гигантской газовой туманности.  Считал,  что решению таких проблем  в  Ф.  как  проблемы  бытия,  морали  и  религии  должно предшествовать исследование возможностей человеческого познания, и установление его границ. Мы познаем мир не так как он есть на самом деле, а только  так  как он нам является. Утверждал существование некоего предмета вне нашего  сознания, к-рый  он  наз.  вещь  в  себе  ("ноумен").  Но  последняя  с  другой  стороны, принципиально   непознаваема,    являясь    потусторонней    нашему    сознанию (трансцендентной).  
<br>Гегель  -  все,  что  существует,  существует  в  мышлении.  В  основе  мира  - абсолютная идея - мировой разум. В своем  развитии  идея  проходит  три  этапа, потому что активна: 1) развивается сама в себе, логике через систему категорий, существует объективно; 2) идея выходит во вне и  создает  природу;  3)  идея  в мышлении, развитие ее - в духе. Минус – система предполагала завершение процесса развития. 
<br>Разработал теорию диалектики (включает в себя систему принципов,з-нов, континентов). Диалектика – теория, метод, согласно кот. все объекты мат. Мира след. Рассм. В развитии и взаимосвязи друг с другом
<br>Фейербах  -  материалист.  Выступал  против  идеалистической  системы  Гегеля. Показал,  что  идеализм  является  теоретической  основой  религии.  Критически оценивал агностицизм  Канта.  Ощущения не отделяют нас от внешнего мира, а связывают  нас  с  ним.  Оно  есть образ объективного мира. 1) Чел. рассматривался как био. существо, игнорируя соц. сущность. 2) Абстрактное понимание чел-ка. (в неисторическое). 3) Носит механистический хар-р.
 

'''

ans_12 = '''
<br>К середине XIX вв. буржуазные революции уже были позади. Капитализм интенсивно развивался на собственной основе. Возникли крупные промышленные предприятия, формировался пролетариат, который начал вести борьбу за свои права. Классовая борьба пролетариата носила стихийный, неорганизованный характер, но на основании этой борьбы К. Маркс и Ф. Энгельс пришли к выводу о всемирно-исторической, освободительной миссии рабочего класса и неизбежности перехода от капитализма к социализму. 
<br>Естественно-научные предпосылки философии марксизма следующие:
<br>1. Закон сохранения и превращения энергии.
<br>2. Клеточная теория строения живых организмов.
<br>3. Эволюционная теория Ч. Дарвина.
<br>Все они подтверждали материальное единство мира, развитие материи, взаимосвязь различных форм бытия.
<br>Теоретические источники философии марксизма:
<br>1. Немецкая классическая философия.
<br>2. Английская классическая политэкономия А. Смита и Д. Рикардо.
<br>3. Французский утопический социализм (М. Фурье, А. Сен-Симон и др.).
<br>Диалектика Гегеля и материализм Л. Фейербаха способствовали становлению диалектического материализма К. Маркса и Ф. Энгельса. Трудовая теория стоимости А. Смита и Д. Рикардо доказывали, что труд – источник всех богатств. На основе данной теории К. Маркс создал учение об определяющей роли материального производства в жизни общества и теорию прибавочной стоимости. Французский утопический социализм повлиял на становление научной теории преобразования общества К. Маркса и Ф. Энгельса.
<br>Марксизм – это система научных взглядов на объективные законы развития природы и общества, на революционное преобразование социальной действительности. Основные идеи марксизма таковы:
<br>1. Связь теории и практики. «Философы лишь различным образом объясняли мир, но дело состоит в том, чтобы изменить его» (К. Маркс).
<br>2. Создание исторического материализма, согласно которому материальное производство определяет развитие общества, т.е. общественное бытие определяет общественное сознание. Труд – «обмен веществ с природой», основа развития человека и его сознания.
<br>3. Изменение способа производства ведет к изменению общественно-экономической формации. Совокупность производственных отношений составляет экономический базис, на котором возвышается политическая и идеологическая надстройки.
<br>4. Проблема отчуждения человека в процессе капиталистического производства.
<br>5. Человек есть совокупность всех общественных отношений.
<br>6. Техника – это «неорганическое тело человека».
<br>7. «Марксизм – не догма, а руководство к действию».

'''

ans_13 = '''
<br>К основным направлениям неклассической философии, объединенным духом антисциентизма, традиционно относят: герменевтику, интуитивизм, феноменологию, философию жизни, психоанализ, экзистенциализм.
<br>Все направления неклассической философии условно можно разделить на две большие группы:
<br>1)	направления, поддерживающие общие принципы рационалистической философии. К этой группе могут быть отнесены все неоклассические школы, а также направления, концептуальные основания которых в целом построены на традиционно-классическом понимании рациональности.
<br>2)	направления иррационалистического характера 
<br> Основное внимание философов направлено на сферу субъективного, понимание которого также существенно расширяет прежние представления о человеке. В указанный период философы обращаются к осмыслению таких проявлений субъективности, которые обычно считались второстепенными, а то и вовсе исключались из сферы сознания (воля, интуиция, бессознательное и т.д.). Основной проблемой неклассической философии является проблема сознания.
<br>     Серен Кьеркегор(1813-1855) – датский философ и писатель. Он является одним из  основателей  экзистенциальной  философии.  Кьеркегор говорил, что недостатком классической философии является то, что вопрос о человеке она решает слишком абстрактно, т.е. её интересует не конкретный живой человек с его проблемами, переживаниями, страданиями, а «человек вообще». Философия должна повернуться к человеку и помочь ему существовать в этом сложном и абсурдном мире. Именно он ввёл в философский оборот понятие «экзистенция», определяя ее как «бытие– между».
<br>    Фридрих Ницше– немецкий философ, один из основателей философии жизни, исходящей из той мысли, что один лишь разум, прежде считавшийся универсальным органом философии, недостаточен для выработки целостного мировоззрения Учение Ницше делится на две части:
<br> 1) позитивную(идея«сверхчеловека», «любви к дальнему» и др.); 
<br>2) негативную(идея «воли к власти», «вечного возвращения» и др.). 

'''

ans_14 = '''
<br>Модернизм (фр. moderne – новейший, современный) как феномен имел в истории культуры разные объяснения: как новое в искусстве и литературе (кубизм, дадаизм, сюрреализм, футуризм, экспрессионизм, абстрактное искусство и т. п.); как направление в католицизме, которое стремится к обновлению вероучения на основе науки и философии; как осмысление качественно новых феноменов или качественно новой интерпретации уже известного в философии.
<br>Так, к модернизму в свое время относили:
<br>– позитивизм;
<br>– марксизм;
<br>– Просвещение.
<br>Философский постмодерн – специфика философской мысли, которая представлена следующими именами:
<br>– Жак Лакан;
<br>– Жак Деррида;
<br>– Жорж Батай;
<br>– Жиль Делез;
<br>– Жан Франсуа Лиотар;
<br>– Жан Бордрийяр;
<br>– Ричард Рорти и др.
<br>Главная задача постмодернистов – сломить многовековой диктат законодательного разума, показать, что его претензии на познание истины являются гордыней и ложью, использованными разумом для оправдания своих тоталитарных притязаний.
<br>Основные принципы постмодерна:
<br>– объективная сущность – иллюзия;
<br>– истина неоднозначна, множественна;
<br>– обретение знания – это бесконечный процесс пересмотра словаря;
<br>– действительность формируется под воздействием человеческих желаний и поступков;
<br>– человеческое познание не отражает мир, а интерпретирует его, и ни одна интерпретация не имеет преимуществ перед другой и т. п.
<br>Одним из первых мыслителей философии постмодерна является француз Жан Франсуа Лиотар.
<br>В своей книге «Состояние постмодерна» (1979) он разъясняет феномен постмодерна как культурологический в целом, как своего рода реакцию на универсалистское видение мира в модернистской философии, социологии, религиоведении, искусстве и т. д.
<br>Лиотар считает, что отличие постмодернистской философии от марксистской – в утверждении идеи выбора из нескольких альтернатив, которые представляются не столько в познанном, сколько в исторической конфигурации жизненных практик, в социальной сфере.
<br>Постмодернизм представлен современными:
<br>– постструктурализмом (Ж. Деррида, Ж. Бордрийяр);
<br>– прагматизмом (Р. Рорти).
<br>Американский философ Ричард Рорти выдвинул мнение, что вся до сих пор существовавшая философия искажала личностное бытие человека, ибо лишала его творчества.
<br>В своем учении Рорти совмещает прагматизм с аналитической философией, утверждая, что предметом философского анализа должны быть социум и формы человеческого опыта. Для него социум – общение людей, а главное в нем – интересы личности, «собеседника».
<br>Постмодернист, французский философ Жак Деррида – один из ярчайших представителей современного постструктурализма.
<br>Деррида критикует понимание бытия как присутствия. Он считает, что живого настоящего как такового не существует: оно распадается на прошлое и будущее.
<br>Многие постмодернисты предлагают новый тип философствования – философствование без субъекта.
<br>Постмодернизм – это реакция на изменение места культуры в обществе: на сдвиги, происходящие в искусстве, религии, морали в связи с новейшей техникой постиндустриального общества.
<br>Постмодернизм предлагает перейти на гуманитаризацию, антропологизацию философского знания.

'''

ans_15 = '''
<br>У ее истоков стояли английские философы Джордж Эдвард Мур и Бертран Рассел, а также немецкий логик и математик Гот-лоб Фреге. Аналитическая философия наследует традиции изучения оснований знания - как в его чувственной, эмпирической, так и в рациональной, теоретической форме. Общая характерная черта данного направления - детальное исследование языка (с учетом новейших достижений логики и лингвистики) с целью решения философских проблем. Главные цели философии анализа - выявление структуры мысли, прояснение всего смутного, невнятного, достижение «прозрачного» соотнесения языка и реальности, четкое разграничение значимых и пустых выражений, осмысленных и бессмысленных фраз. Внутри аналитической философии выделяют два направления: философию логического анализа и философию лингвистического анализа. Приверженцы первого в основном интересуются философией и логикой науки. Сторонники второго считают такую ориентацию искусственной и слишком узкой, чрезмерно ограничивающей философский кругозор.
<br>   Развивать аналитическую философию начали Мур и Рассел. Оба философа уделяли большое внимание традиционным проблемам теории познания, решаемым в духе реализма: признание независимости предмета познания от его восприятия, факта - от суждения о нем. . Внимание Рассела сосредоточилось на аналитических возможностях символической логики и исследовании основ математики. . Мур - английский философ, один из основоположников англо-американского неореализма и лингвистической ветви аналитической философии. Статья «Опровержение идеализма» стала отправной точкой реалистического движения в Англии. В решении проблем теории познания он выступил как убежденный реалист, а по методам исследования - как аналитик. Свою критику Мур направил прежде всего против идеалистического отождествления «опыта» и «реальности». Мур считает ошибочным аргумент о тождестве восприятия и воспринятого. Много внимания Мур уделил вопросу о соотношении чувственных данных и физических объектов.
<br>В аналитической философии XX века мы находим и важные собственно философские достижения: осмысление тесной связи человеческого опыта с речевой коммуникацией, схемами языка, новое понимание на этой основе специфики философской мысли, философских проблем. Идеи аналитической философии наиболее сильны в англоязычных регионах мира.

'''

ans_16 = '''
<br>Коммуникативная философия связана с проблемой понимания-герменевтика (Гадамер)
<br>       Коммуникативное действие - передача, потребление информации, энергии.
<br>       Комммуникативное действие - то действие в режиме диалога, общения, обратной связи.
<br>Философия неомарксизма (коммуникативного действия) Хабермас.
<br>Фундаментальный труд Ю. Хабермаса, в котором синтезированы разработанные им способы развития социальной теории и обоснован коммуникационный подход к социальной реальности.
<br>В ее основе лежит исследование дифференциации между жизненным миром и отчуждающей его социальной системой, выяснение соотношения социального действия и существующих социальных структур с целью преодоления кризисных явлений современной общественной жизни и ее гуманизации. В теории выявлены интегративные компоненты, определяющие социальное развитие, и на основе их анализа построена новая социальная парадигма. Это — коммуникативные отношения, или интеракции, в которых их участники согласуют и координируют планы своих действий; при этом достигнутое согласие измеряется интерсубъективным признанием притязаний на значимость. В условиях господства формальной рациональности и технократического сознания они утратили свое значение, поэтому задача теории состоит в том, чтобы обосновать их продуктивную инновационную роль

'''

ans_17 = '''
<br>       Синерге́тика — наука, занимающаяся изучением процессов самоорганизации (процесс упорядочения элементов одного уровня в системе за счёт внутренних факторов) и возникновения, поддержания, устойчивости и распада структур самой различной природы. Синергетика - универсальная теория эволюции, дающая единую основу для описания механизмов возникновения любых новаций.
<br>Область исследования синергетики распространяется на все отрасли естествознания. Общим признаком является рассмотрение динамики любых необратимых процессов. 
<br>Существуют несколько школ, в рамках которых развивается синергетический подход:
<br>1) Школа нелинейной оптики, квантовой механики и статистической физики Германа Хакена. В 1973 году он объединил большую группу учёных вокруг серии книг по синергетике, основанных на методологии синергетики: от физики твёрдого тела и лазерной техники и до биофизики и проблем искусственного интеллекта.
<br>2) Физико-химическая и математико-физическая Брюссельская школа Ильи Пригожина, в русле которой формулировались первые теоремы, разрабатывалась математическая теория поведения диссипативных структур (термин Пригожина), раскрывались исторические предпосылки и провозглашались мировоззренческие основания теории самоорганизации.
<br>Синергетика объясняет процесс самоорганизации в сложных системах следующим образом:
<br>1) Система должна быть открытой. Закрытая система должна в конечном итоге прекратить любые эволюции.
<br>2) Открытая система должна быть достаточно далека от точки равновесия. В точке равновесия система не способна к какой-либо самоорганизации. 
<br>3)Фундаментальным принципом самоорганизации служит возникновение нового порядка и усложнение систем через флуктуации (случайные отклонения) состояний их элементов и подсистем. 
<br>4)Самоорганизация, имеющая своим исходом образование через этап хаоса нового порядка, может произойти лишь в системах достаточного уровня сложности, обладающих определённым количеством взаимодействующих между собой элементов.
<br>5)Этап самоорганизации наступает только в случае преобладания положительных обратных связей, действующих в открытой системе, над отрицательными обратными связями. 
<br>6) Самоорганизация в сложных системах, переходы от одних структур к другим, возникновение новых уровней организации материи сопровождаются нарушением симметрии.

'''

ans_18 = '''
<br>Эпоха ренессанса в Беларуси 16–17ст.
<br>Для философской мысли XVI в. характерно развитие вольнодумства, свободомыслия и идей гуманизма. На развитие философской мысли большое влияние оказывали общекультурные явления в Европе, такие как Возрождение и Реформация. В общественном мировоззрении начался процесс формирования новых ориентации, связанных с утверждением антирелигиозных ценностей. Развитие светской культуры встретило жестокий отпор со стороны церковных властей. В частности, результатом борьбы католической церкви против реформаторских идей явилась Брестская уния (1595), которая узаконила и усилила католическую реакцию.
<br>Ефросинья Полоцкая. Основной источник её идей «Житие Ефросиньи  Полоцкой». Для  Ефросиньи достижение идеала неразрывно связано со Словом Божьим и знаниями, содержащимися в книгах
<br>Священного писания. Высшая духовная реальность и есть сущность бытия. Основные идеи: 
<br>1)  идея противопоставления неподлинной и истинной жизни. Истинная жизнь– это верность идее и избранному пути; 2)  идея ориентации человека на высшие ценности и благородные цели; 3)  идея патриотизма; 4)  идея просвещения, любви к книге; 5)  идея духовного служения. 
<br>Видный представитель эпохи вольнодумства — Франциск Скорина (ок.1490-1541). Его жизнь и деятельность, интересы и ориентации отвечали атмосфере эпохи Возрождения. Получив блестящее образование, Франциск Скорина основал типографию, переводил, издавал и распространял литературу. Его заслугой является первое светское издание Библии (в то время право издания Библии монопольно принадлежало церкви, даже чтение ее было запрещено простым людям, и только представители духовенства имели право на чтение текстов священной книги, их интерпретацию). Издание Библии, да еще с предисловием, где Скорина говорил об историческом и культурном, а не только о религиозном значении Библии, было прямым вызовом церковным порядкам. Философ проповедовал идеи веротерпимости, защищал принципы личных отношений с Богом (без посредничества церкви), отстаивал полезность образования и идеи, которая утверждает достоинство человека. Заслугой Скорины является то, что свои взгляды он распространял на белорусском языке, тем самым содействуя развитию национальной культуры.
<br>Критическое отношение к церковной политике и Священному писанию высказывал видный просветитель XVI в. Симон Будный (ок. 1530-1593). Этот мыслитель-гуманист сделал перевод Библии, поставив перед собой задачу исправить "глупости переписчиков" и "хитрость еретиков" как "ошибки прежних переводчиков". Его ин-терпретация библейских текстов содержит первые при-меты атеистического мировоззрения.
<br>Дальнейшее развитие идей вольнодумства, атеизма связано с деятельностью Казимира Лыщинского (1634— 1689) в мрачную эпоху господства католической церкви Речи Посполитой. Лыщинский был наказан смертью за распространение атеистических мыслей. Его рукопись "О существовании Бога", которая послужила основой для доносов, а потом и наказания, была сожжена.
<br>Таким образом, в XVI-XVIII вв. в Беларуси усилилась свободолюбивая тенденция в развитии общественно-политической мысли, получили распространение идеи, которые развивали С.Щадурский, К.Нарбут, Б.Добшевич и др. Они протестовали против церковного угнетения, схоластики, отстаивали права человека на свободу мысли и действий.
<br>К концу XVIII в. Беларусь вошла в состав России, что дало новые возможности для развития духовной жизни под воздействием русской культуры. 

'''

ans_19 = '''
<br>Существенным этапом развития русской философской мысли становится Просвещение (18 век). В этот период философия постепенно приобретает самостоятельный статус, освобождается от диктата богословия. Философия России этого периода опирается на деистические представления и на теорию «двух истин» (истины богословия и философии/науки самостоятельны и независимы). В целом философская мысль этого периода носила ярко выраженный пранаучный и политический характер. 
<br>      Подлинно оригинальная национальная философия в России появляется уже в 19 веке. Особенностью развития русской философии 19 века, идейно связанной с трудами Чаадаева, становится противостояние западников и славянофилов. связывали развитие России с усвоением исторических достижений Западной Европы. Духовным идеалом здесь провозглашалась католическая вера, способная оживить православие и русскую историю.
<br>Русская философия советского периода изначально потеряла целую плеяду знаменитых философов, особенно религиозных (что связано было с эмиграцией большинства философов, несогласных с идеологической доктриной большевиков), и, в основном, замкнулась в рамках марксизма.
<br>     Фил-я всеединства. Всеединство – идеальный строй мира, предполагающий воссоединенность, примиренность и гармонизированность всех эмпирических несогласованных элементов и стихий бытия(Соловьев). Всеединство – гармония и согласованность всех частей Вселенной. Но абсолютное всеединство – Бог, а мир всеединство в состоянии становления. Соловьев разделяет всеединство на 2 вида: истинное и ложное. Он называет истинным то, в котором единое существует не за счет всех или в ущерб им, а в пользу всех. Ложное, отрицательное единство подавляет, входящие в него элементы и таким образом оказывается пустотой.
<br>   Русская идея с точки зрения Соловьева – конкретное выражение принципа всеединства. Национальная идея русского народа – внести вклад в мировую копилку.
<br>   Идея космизма была превнесена в российскую культуру вместе с православием. Со временем он приобрел естесстественонаучный и философский смысл. Космизм основан на восприятии человека как элемента космического единства, человек как часть Вселенной.(Федоров, Соловьев, Бердяев, Флоренский).
<br>   Основные фамилии: Данилевский, Аксаков, Самарин, Хомяков, Бердяев, Чадаев.

'''

ans_20 = '''
<br>Онтология - метафизическое учение о бытии.
<br>Различают 4 сферы бытия: 
<br>1)   бытие природы;   2)   бытие общества;    3)   бытие человека;    4)   бытие духовного. 
<br>Духовным, то есть идеальным основанием всего сущего могут быть: •  Бог, как единое и несотворенное бытие, создающее весь остальной мир. •  Числа(Пифагор и его последователи). 
<br>•  Идеи(Платон и его последователи). •  Форма(Аристотель). •  Монады как бесконечно малые духовные единицы(Дж.Бруно, Г.Лейбниц) 
<br>    Материя– это философская категория для обозначения объективной реальности, которая дана человеку в его ощущениях(Ленин). 
<br>Структура материи: Неорганическая материя: ? ← физический вакуум ← элементарные частицы ←
<br>атомы ← молекулы ← макротела ← планетарные системы ← галактики ← метагалактика ←? 
<br>Органическая материя: ? ← белковые и нуклеиновые молекулы ← одноклеточные организмы ← многоклеточные организмы ← популяции ← биоценоз ← биосфера ←? 
<br>    Способом существования материи является движение. Движение– это изменение вообще.Движение выступает как взаимодействие и взаимная связь предметов и явлений. Движение невозможно без своей противоположности– покоя. Покой проявляется в факте существования различных структурных образований, объективных законов, которые суть устойчивые повторяющиеся связи. Без покоя, устойчивости не было бы и изменения, так как тогда нечему было бы изменяться. Материальный объект, мыслимый без движения– это объект, не имеющий структуры и свойств, то есть объект, лишенный возможности проявлять свое существование.
<br>   Принципы классификации форм движения материи: 
<br>1) Связь формы движения с определенной формой материи, то есть по материальному носителю. 
<br>2) Генетическая связь, то есть происхождение высших форм движения материи из низших форм. 
<br>3) Специфические законы. 
<br>Исходя из этого, различают 5 основных формы материи: 1.  Механическая– движение макротел. 
<br>2. Физическая(молекулярно-физическая, ядерно-физическая). 3.  Химическая– движение атомов. 
<br>4.  Биологическая– «движение» белковых и нуклеиновых молекул, т.е. жизнь. 5.  Социальная форма движения. 

'''

ans_21 = '''
<br>Пространство – это форма бытия материи, характеризуемая протяженностью, структурностью, сосуществованием и взаимодействием. Время– это форма бытия материи, характеризующаяся такими свойствами изменения и развития систем, как длительность, последовательность смены состояния. 
<br>Общие свойства пространства и времени: 
<br>1. Объективность. 
<br>2. Всеобщность. 
<br>3. Абсолютность и относительность. 
<br>4. Бесконечность. 
<br>Специфические свойства пространства и времени: 
<br>Пространство      Время
<br>1. Обратимость  1. Необратимость
<br>2. Трехмерность  2. Одномерность
<br>3. Изотропность  3. Не является изотропным
<br>4. Прерывность(дискретность)  4. Непрерывность
<br>А. Пуанкаре различал пространство геометрическое и пространство представлений.  Например: визуальное,  тактильное,  моторное  пространство.  
<br>Пространство представлений не является однородным, изотропным и трехмерным, оно аморфно. И форму ему сообщают те вещи, которые в нем находятся. В психологии существует закон эмоционально - детерминированной оценки
<br>времени: время, окрашенное положительными эмоциями в восприятии сокращается, а время, окрашенное отрицательными эмоциями – удлиняется, т.е. время можно рассматривать как субъективную форму восприятия человека.


'''

ans_22 = '''
<br>Диалектика – учение о всеобщих, универсальных законах взаимосвязи, движения и развития природы, общества и духовно-познавательной деятельности человека; умение вести диалог, спор, беседу, строить доказательства и формулировать выводы. 
<br> Развитие – это движение материальных системных объектов, при котором происходит необратимый, направленный и закономерный переход от одного качественного состояния системы к другому ее качественному состоянию.
<br>Объективная диалектика – это принципы и законы, которые отражают сущность бытия; 
<br> субъективная диалектика – это правила построения мысли, способы и принципы познания развивающегося мира. 
<br>Диалектику разрабатывали – Гераклит, Сократ, Платон, Аристотель. В Средние века диалектика входила в школьную программу как одно из семи искусств и обозначала умение логически рассуждать. Также разработкой диалектики занимались Кант и Гегель. Диалектический метод позволяет анализировать систему в единстве трех важнейших аспектов ее бытия: статическом, динамическом и функциональном. 
<br>Значительную роль в утверждении принципа глобального эволюционизма сыграла синергетика– теория согласованного состояния процессов самоорганизации в сложных системах различной природы. В рамках синергетического подхода исследуются сложные, открытые системы в неравновесном состоянии. Самоорганизация в таких системах выступает как процесс, приводящий к образованию новых структур, свойств и качеств. В стабильном состоянии система данного типа функционирует на основе принципа детерминизма, ее элементы подчиняются факторам порядка. 
<br>Впервые явление самоорганизации было установлено при изучении лазеров в 70-х годах XX в. В настоящее время синергетический подход широко используется в различных науках, например математике, биологии, химии, психологии и др. Синергетика позволяет синтезировать результаты из различных областей знания. 

'''

ans_23 = '''
<br>23.	Принципы и законы диалектики
<br>Принципы диалектики вводят представление о развитии как объективном, взаимосвязанном, системном, детерминированном процессе. 
<br> Закон единства и борьбы противоположностей указывает на источник, импульс, причину развития. Таким источником является противоречие, которое возникает в процессе взаимодействия противоположных сторон. В различных сферах бытия этот закон имеет специфические характеристики. Например, в неорганической природе противоречия носят объективный характер, т.е. происходят без участия человека, а в социальных системах противоречия напрямую связаны с деятельностью людей, их судьбой, существованием.   Противоречия бывают: внутренние и внешние, основные и неосновные, главные и 
<br> неглавные.
<br> Закон перехода количественных изменений в качественные раскрывает механизм развития. Основные категории этого закона: качество, количество, мера, скачок. 
<br> Качество – это философская категория для отражения предмета в единстве его свойств, в системе его связей и отношений с другими предметами. Социальная философия качества отражает соответствие предмета ожидаемым потребностям потребителей. Эта философия разработала методологию качества, в которой важную часть занимают организационные структуры. Их деятельность связывается с понятием менеджмента качества. Количество – это философская категория для отражения степени развития и интенсивности свойств предмета, выраженных в величинах и числах. Мера – это философская категория для отражения диалектического единства качества и количества, или такого интервала количественных изменений, в пределах которого сохраняется качественная определенность предмета. Скачок – это философская категория для отражения перехода количественных изменений в качественные или перехода из одного количественного состояния в другое в результате повышения меры. 


'''

ans_24 = '''
<br>24.	Философия природы
<br>Природа –это совокупность естественных условий существования человека и общества.  
<br> Природа разделяется на живую и неживую. Человек изменяет природу и символизирует себя в ней. В индийской философской традиции мир – живой организм, и любое действие по отношению к нему требует нравственных оснований. Для философии Древней Индии характерен интерес, как к человеку, так и к целостности мира. То и другое выливается в единство, которое лучше всего выражается формулой «Атман есть Брахман». Атман – это духовное начало, душа. Брахман – это безличный абсолют, из которого происходит все остальное. Основная мысль заключается в том, что Атман и Брахман совпадают – «Все есть Атман, все есть Брахман». В философии Древнего Китая основным понятием для постижения Вселенной и человека становится Дао (путь) – безличный мировой закон. Жить «по – дао» означает «следовать естественности» не искажать своими действиями порядок вещей в мире. Для традиционных культур подобные принципы играют важную регулирующую роль. 
<br>Космоцентризм– отличительная черта греческой философии. Ее горизонты всегда охватывают весь Космос, в том числе и человека (макрокосмос, микрокосмос). 
<br>  Теоцентризм – отличительная черта философии и культуры средних веков. В этом направлении Глубочайшая проблема средневекового мировоззрения – отношение человека и мира к Богу. 
<br>Антропоцентризм дает новое мироощущение. В эпоху Возрождения возвращается интерес к природе. Это приводит к интенсивному развитию научных знаний, естественных наук. В XVII – XVIII изменяется мировосприятие. Распространяется признание свободы и величия человека, его разума. Знание рассматривается как сила и тот, кто владеет им, обретает могущество (Ф. Бэкон). 
<br> В XVII в. происходит опровержение представления о самозарождении жизни (Реди). 
<br> В XVIII в. в естествознании и философии складываются предпосылки диалектического понимания природы. 
<br> Кант придает особое значение активности живых организмов, а также трансформации внешних факторов под воздействием внутренних особенностей органических тел. 
<br>В 19 в особое значение приобретает клеточная тория (Шван) и теория эволюции (Дарвин). Устанавливаются законы развития живой природы. 
<br>В XX в. переосмысливается место, роль и назначение человека в масштабах Космоса. Создание теории относительности, квантовой механики полностью изменяют понимание природы, Вселенной. На фоне превращения деятельности человека в  планетарную силу, как созидательную, так и разрушительную, особое значение приобретают идеи космизма. 
<br>Также вырабатывается концепция ноосферы (Вернадский). Ноосфера – это область господства разума. Развитие космопрактики приводит к социоприродной системы «Человечество-Земля Вселенная».

'''

ans_25 = '''
<br>25.	Философские концепции естествознания
<br>Естествознание XX века имеет дело с множеством картин природы, онтологических схем и моделей, нередко альтернативных друг другу. С середины XX века идеи самоорганизации становятся основой нового стиля мышления и нового миропонимания. Разрабатываются принципы глобального эволюционизма. В обоснование глобального эволюционизма внесли свой вклад многие естественнонаучные дисциплины, но определяющее значение в его утверждении сыграли: теория биологической эволюции и развития на основе концепции биосферы и ноосферы; теория нестационарной Вселенной; синергетика. Глобальный эволюционизм позволяет: выстроить новую картину мира; рассмотреть во взаимосвязи неорганическую, живую и социальную материю; установить существование единой прогрессивной эволюции от Большого взрыва до возникновения жизни и разума. 
<br>Современная картина природы дает эволюционистское и синергетическое понимание реальности; включает человека как неотъемлемую характеристику картины мира; позволяет рассмотреть все многообразие процессов в Метагалактике в аспекте концепции самоорганизации. 
<br>Главное место в изучении процесса соотношения общества и природы принадлежит геологии.  Земная кора выступает основным объектом геологии. Земные оболочки выделяются по их основному содержанию: гидросфера – жидкая земная оболочка; литосфера – твердая часть земной коры; биосфера – оболочка, состоящая из живых организмов; атмосфера – воздушная оболочка; тропосфера – нижняя часть атмосферы. 
<br> ХХ век – время великих открытий в науке о жизни: обоснованы материалистические концепции возникновения жизни, происходит становление генетики, молекулярной биологии, экологии и других дисциплин, повлекших качественные изменения в этой области знаний. В биологии наших дней разработаны важные теоретические представления о сущностных характеристиках, о закономерностях структурно-функциональной организации и развития органической жизни. Огромное теоретическое и мировоззренческое значение имело становление классической генетики. Генетика открыла новые возможности для теоретической интерпретации взаимодействия организма и среды, для понимания единства жизни. 
<br> Углубление биологии в познание молекулярного уровня биосистем сделало возможным познание сложных уровней организации живой природы – биоценотического, биосферного. Однако самым выдающимся достижением биологической науки является теория эволюции путем естественного отбора.
<br>Биология уже не только изучает, но и непосредственно влияет на мир живого. развитие биологии может способствовать решению ряда глобальных проблем (экологической, продовольственной, медицинской).

'''

ans_26 = '''
<br>26.	Биосфера и ноосфера
<br>Биосфера – это область активной жизни, охватывающая нижнюю часть атмосферы, гидросферу и верхнюю часть литосферы. Понятие биосфера было введено австрийским учёным Э. Зюссом в 1875 году.
<br>Термин «ноосфера» был введен в начале 20-х годов прошлого столетия Леруа и Шарденом. Под ноосферой они понимают новую оболочку планеты, которая возникает после биосферы и над ней. Биосферу рассматривают как необходимый этап в развитии планеты для возникновения ноосферы. Так, Леруа сравнивает ноосферу с белой скатертью, которой прикрыта биосфера. Из биосферы бьют фонтанчики, питающие ноосферу необходимыми веществами. 
<br>Вернадский начинает рассматривать ноосферу как качественно новый этап эволюции биосферы,  обусловленный историческим развитием человечества, его трудом и разумом.. 
<br>Биосфера, как и любая целостная система равновесна не только с окружающей средой, но и во взаимодействии частей. Именно это обеспечивает ее существование. Однако это равновесие динамическое. Оно развивается в борьбе противоречивых процессов, от менее к более активному полюсу. Вернадский считал, что с возникновением человечества и развитием его производственной деятельности, оно постепенно становится основным геологическим фактором преобразования верхней оболочки земли. Он приходит к выводу, что человечество сможет обеспечить свое будущее только в том случае, если возьмет на себя ответственность за развитие биосферы в целом. Вернадский предложил понятие «ноосфера» – сфера разума. Ноосфера – это целостная оболочка Земли, населенная людьми и рационально преобразованная ими в соответствии с законами сохранения и поддержания жизни для гармоничного существования общества и природы. «Ноосфера» становится центральным междисциплинарным понятием ,так как играет важную роль в построении целостной системы знаний об окружающей общество природе во взаимосвязанности всех ее частей. 
<br>С обостренным характером противоречий между человеком и биосферой столкнулось современное поколение людей. Человечеству угрожают  экологические катастрофы, связанные с загрязнением среды, дефицитом ресурсов, перенаселением.
 

'''

ans_27 = '''
<br>27.	Философия человека
<br>Достоевский: «Человек есть тайна, и её надо разгадывать всю жизнь».
<br>   Сократ первым поставил проблему человека в качестве основной проблемы философии: «Познай себя». Его ученик Платон: «Человек – это двуногое существо без перьев». По Аристотелю: «Человек – это социальное существо или политическое животное». Тогда же софист Протагор: «Человек есть мера всех вещей».
<br>В средние века проблема человека обретает некоторую самоценность, т.е. христианство явилось почвой современной персоналистической традиции. Августин Аврелий: «Человек – это душа, существующая независимо от тела». Аквинский: «Человек – единство теда и  души, это существо промежуточное между животными и ангелами».
<br>   В эпоху Возрождения человеческая личность, её свобода рассматривались. как высшие ценности. Пико дела Мирандола в трактате «Речь о достоинстве человека»: «Человек – творец самого себя»; «Прекрасное достоинство человека – быть тем, кем он хочет: скотом или возвышенным существом».  
<br>   Основатель классической немецкой философии Кант: «Вопрос о том, «что сеть человек» - основной вопрос философии. Человек – это существо отличное от вещей и животных, это индивид особого рода, это существо, предназначенное для общества, хотя и не всегда общительное». Кант говорил, что есть 3 уровня анализа сущности человека: [1] лингвистический (что я могу знать?); [2] практический (что я должен делать?); [3] этический (на что я могу надеяться?);
<br>Фейербах: «Человек – это телесное психофизическое существо, неотделимое от природы». В центре его философии живой конкретный человек, причём тело он рассматривал как основу целостности человека. Антропологический принцип его философии формулируется следующим образом: «Человек – это высшее существо природы». 
<br>Ницше: «Человек – это существо, промежуточное между животным и сверхчеловеком. Сверхчеловек – это человек, который способен себя превзойти». 
<br>   Н.Бердяев в книге «Философия свободы. Смысл творчества» заявлял: «Человек есть существо свободное, творческое». Сартр придерживался того же.
<br>   З.Фрейд определял человека, как единство трёх инстанций: 
<br>	бессознаетельной (Иго);
<br>	предсознательной (Эго);
<br>	сознательной (Суперэго).
<br>«Человек – это машина, движимая постоянным комплексом сексуальной энергии (либидо)».
<br>   Мартин Хайдеггер: «Человек – это прежде всего экзистенция; обителью его экзистенции является язык => человек – это прежде всего язык».
<br>   Ю. Хаберман: «Человек – это существо интерсубъективное».

'''

ans_28 = '''
<br>28.	Природа и сущность человека
<br>Природа (в широком смысле слова) – это всё многообразие движущихся материй, её свойств и состояний. Природа (в узком смысле слова) – это материальный мир, исключая социальную форму движения материй. 
<br>   Человек и общество связаны с природой прежде всего происхождением. Решающую роль выделения человека из природы сыграл труд, производство материальных благ. Возникнув из природы, человеческое общество в определённой мере обособилось от неё и выступило как новое качество в историческом развитии объективного мира. Роль природы: [1] природа – это необходимая предпосылка функционирования и развития общества; [2] природа оказала влияние на формирование и развитие общественного сознания. Природа – неиссякаемый источник знаний; [3] природные условия воздействуют на формы и темпы исторического процесса. Засухи, наводнения, землетрясения способны уничтожить плоды труда людей и затормозить развитие общества.
<br>   Характерные черты воздействия общества на природу: [1] расширение пространственных границ, освоение человеком природы; [2] дальнейшее изучение и освоение природы вглубь. Это связано с открытием и промышленным использованием новых элементов, микропроцессов, ранее неизвестных свойств и законов природы; [3] усиливается интенсивность использования природных ресурсов. Ежегодно добывается около 200 млрд. тонн руды -> исчерпаемость; [4] возрастает загрязнённость природной среды. Ежегодно в атмосферу выбрасывается около 200 млн. тонн СО.
<br>   Загрязнение окружающей среды – это поступление в природную среду любых твёрдых, жидких и газообразных веществ и видов энергии в таких количествах, которые оказывают вредное влияние на человека, животный и растительный мир как непосредственным, так и косвенным путём. Природа не успевает утилизировать, переработать отходы жизнедеятельности человека.

'''

ans_29 = '''
<br>29.	Личность и общество
<br>Понятие личности является главной характеристикой человеческого индивида. Родившейся человек в течение всей своей жизни социализируется, присваивая социальное – это возможно только в общении, в процессе усвоения культуры. Социализация зависит от среды обитания, влияния эпохи, психофизиологических особенностей человека, поэтому нет 2-х одинаковых личностей. Степень присвоения социального у всех различна. Процесс присвоения быстрее идёт в детстве, но продолжается всю жизнь. Личность – это единство общего ,особенного, единичного. Личность  формируется под влиянием материальной, социальной, политической, духовной жизни общ-ва. Каждому этапу присущ свой тип личности.
<br>Типы личности: активная и пассивная; личность ориентированная на интенсивное и экстенсивное развитие; творческий тип личности; эгоцентрический тип личности; западный или деловой; восточный (рефлексирующий). Процесс формирования происходит под влиянием окружающей среды. К объективным условиям формиров-ия личности также относятся материальные факторы соц-ой среды - это условия труда, быта, предметы обихода, определенные инстинкты, каналы и средства передачи информации, транспорт, клубы. Человек практически не бывает включенным в одну среду. Множественность сред говорит о том, что чел-к может выполнять различные функции, в зависимости от того, в которой к-ой соц-ой среде он находится. Личность может обладать относительной самостоятельностью. Индивид только тогда заслуживает право называться личностью, когда он яснее осознаёт мотивы своего поведения.

'''

ans_30 = '''
<br>30.	Философия сознания
<br>Сознание – высшая форма отражения действительности
<br>-субъективный образ объективного мира
<br>-субъективная реальность
<br>-продукт общественного развития
<br>-функция высокоорганизованной материи мозга
<br>Проблема сознания всегда привлекала внимание философов. Их интересовало происхождение, сущность, специфика сознания, его отношение к материальному миру. Сознание – чрезвычайно сложный и таинственный феномен. Оно является предметом изучения психологии, антропологии, логики, социологии и др. В философии сложилось несколько традиций, анализирующих проблему сознания. В классической философии основными стратегиями исследования являются субстанциональная и функциональная; в постклассической – экзистенциально-феноменологическая и психоаналитическая. 
<br> Субстанциональная концепция (Платон, Аристотель, Августин, Гегель и другие) рассматривает разум как объективное и универсальное свойство сознания. Индивидуальное сознание человека рассматривается как проявление Мирового Разума. 
<br>Функциональная концепция анализа сознания(Дидро,Гельвеция) рассматривала сознание как функцию мозга и отражение действительности и обращала внимание на активную роль сознания в жизнедеятельности человека. 
<br>Экзистенциально – феноменологическая концепция сознания возникла в ХХ веке. Ее представители Э. Гуссерль, М. Хайдеггер, Ж.П. Сартр, К. Ясперс и другие рассматривали сознание как специфический вид бытия, возникающий в результате интериоризации –внешних воздействий во внешнее (мозг), которое трансформирует, преобразует внешнее во внутреннее – в сознание, выходящее за пределы внешнего и развивающегося по собственным законам.  
<br> Психоаналитическая концепция сознания, предложенная З.Фрейдом, рассматривает сознание в единстве с бессознательным, генетически и функционально с ним связанным и оказывающим на него значительное 

'''

ans_31 = '''
31.	Сознание и искусственный интеллект
<br>Сознание – высшая форма отражения действительности
<br>-субъективный образ объективного мира
<br>-субъективная реальность
<br>-продукт общественного развития
<br>-функция высокоорганизованной материи мозга
<br>В ХХ веке стала реальной и необходимой техника, используемая в управленческой функции, способная взять на себя функции человеческого мышления, способная стать естественным продолжением важнейших функций мозга. Эта проблематика приобрела научную основу в мире кибернетике, сочетающей в себе возможности, общей теории систем, математического имитационного моделирования, информатики, компьютерных технологий. 
<br>Т. к. стало очевидным, что коммуникация является ключевым понятием реальности. Это во многом объясняло появление ускоренного по динамике изобретений направления, связанного с техническими средствами коммуникации – телеграф, телефон, радио, телевидение, компьютер.. Компьютеры сменили в 40 – 50-х годах ХХ века механографические машины. Решающую помощь в их разработке оказал фон Нейман. И практически сразу началось слияние телефонной и вычислительной техники. В результате компьютер был интегрирован в структуру сетевого типа. Возникла проблематика, связанная с информатикой, в рамках которой необходимо было определить понятие информации и способы формализации её для использования в компьютерных системах(двоичная система).Представление информации в ЭВМ – ключевое направление развития технизированного управления (искусственного интеллекта). Иску́сственный интелле́кт — наука и технология создания интеллектуальных машин, особенно интеллектуальных компьютерных программ. Ключевая роль в разработке программ принадлежит программистам. Искусственным интеллектом является техническая система, которая решает задачи и способна к самообучению на основе моделей, имитирующих реальность. Системы искусственного интеллекта, используя заложенные в них правила переработки информации, вырабатывают схемы целесообразных действий на основе анализа моделей, хранящихся в их памяти.

'''

ans_32 = '''
<br>32.	Виртуальная реальность и искусственный интеллект
<br>    Термин «виртуальная реальность» был впервые употреблен в Массачусетском технологическом институте в конце 70-х гг. ХХ века. В середине 80-х гг. этого же века Дж. Леньер наладил производство интерактивных компьютеров с головными шлемами, позволяющими пользователю погружаться в виртуальные миры с максимальным спектром ощущений. Ученые определяют виртуальную реальность как явление, связанное с деятельностью сознания человека. Виртуальная реальность существует, пока действует порождающая реальность. Субъект, находящийся в виртуальной реальности, непосредственно не ощущает промежуточных звеньев. При этом он видит все виртуально происходящее со своей точки зрения. Главным участником событий всегда является он сам. Виртуальная реальность обладает свойствами: порожденности, актуальности, автономности, интерактивности. 
<br>   Электронная виртуальная реальность: 1. онтологически обоснована стремлением человека создавать альтернативный мир; 2. проявляется преимущественно знаково; 3. широка по силе воздействия; 4. может менять сознание субъекта (обратная связь). 
<br>Виртуальная реальность – это благодатная основа для реализации компьютерного моделирования в динамике, что позволяет проследить технические характеристики артефакта в максимально приближенных к реальным условиям динамической среды, 1) например, условия боя, бездорожья для транспортной техники, 2) решение ландшафтных задач строительства гидрообъектов, микрорайонов и т.д. Благодаря достигнутому уровню имитационного моделирования актуализировалась бионика. 
<br>      Области применения устройств виртуальной реальности: производство, медицина, бизнес, образование, тренажеростроение, искусство и развлечения. 
<br>     Иску́сственный интелле́кт — наука и технология создания интеллектуальных машин, особенно интеллектуальных компьютерных программ. Ключевая роль в разработке программ принадлежит программистам. Искусственным интеллектом является техническая система, которая решает задачи и способна к самообучению на основе моделей, имитирующих реальность.

'''

ans_33 = '''
33.	Общественное и индивидуальное сознание
<br>Индивидуальное сознание — субъективный образ мира, формирующийся у отдельного человека под влиянием условий его жизни и психических особенностей. 
<br>Структура: Оно имеет внутриличностное бытие, зачастую представляя собой никому не ведомый поток сознания. 
<br>Общественное сознание характеризует коллективные представления формирующимся социальными общностями и группами под воздействием надличностных факторов: материальных условий жизни общества и его духовной культуры. 
<br>Общественное сознание имеет сложную структуру. Выделяются два уровня:
<br>•	обыденное 
<br>•	теоретическое сознание. 
<br>Обыденное сознание неоднородно по своему содержанию. Оно включает:
<br>	накопленный предшествующими поколениями опыт трудовой деятельности, 
<br>	моральные нормы,
<br>	обычаи. 
<br>Оно отличается синкретичностью, подробной детализацией, эмоциональной окрашенностью, стихийностью и практической направленностью. Обыденное сознание, формирующееся под непосредственным влиянием бытовых аспектов жизнедеятельности, консервативно, замкнуто, догматично. 
<br>Теоретическое сознание опирается на обыденное, но преодолевает его ограниченность. 
<br>Формы общественного сознания различаются по объекту отражения и социальным функциям. 
<br>Так, политическое сознание касается сферы классовых, национальных, межгосударственных отношений. Оно объединяет людей в борьбе за коренные интересы соответствующей им общности. Правосознание выражает волю общества по обеспечению приемлемых для него норм социальной жизни. 
<br>Нравственное сознание регулирует поведение чел. в отношениях с другими людьми. Свои важные функции выполняют и другие формы общественного сознания: 
<br>•	эстетическое, 
<br>•	религиозное, 
<br>•	наука, 
<br>•	философия.

'''

ans_34 = '''
<br>34.	Эпистемология и гносеология
<br>Философская теория познания человеком мира начала создаваться в Древней Греции и получила название гносеология. Одновременно там существовал и другой термин – эпистемология, который обозначал процесс научного познания в отличие от обыденного мнения. Оно в отличие от мнения постоянно, лишено субъективной окраски. 
<br>     Гносеология как специальная философская дисциплина возникает в Новое время. Здесь формируется основное гносеологическое отношение «субъект – объект» и осознаётся основная проблема – противостояние, оппозиционность человека и мира. Данная проблема возникает вследствие построения философской теории познания человеком мира на базе обобщения закономерностей научного познания, как наиболее достоверного. 
<br>     Субъектно-гуманистическая философия исходит из предпосылки, что основа мира – человек, а не материальный мир, как в классической философии. Человек в процессе своей жизни не просто познаёт (классическая философия), а осваивает мир, делает его своим. Сущность человеческого освоения мира не разум и знания, а стремление к власти (Ф.Ницше), любовь (Фейербах, Фромм), конструирование мира (Пирс). Существуют различные формы освоения человеком мира: духовно-практическая; рационально-познавательная; художественно-эстетическая; нравственная; обыденная; религиозная и др. 
<br>     Неклассическая гносеология исходит не из абсолютного противопоставления, а относительности объекта и субъекта познания. В гносеологии субъект – это не просто человек познающий, а носитель познавательной активности, обладающий знаниями, умениями и навыками. Субъект познания имеет социальную природу, однако он всегда индивидуален. Неклассическая гносеология строится не на идее отражения объекта субъектом, а на конструктивной идее, которая объясняет построение в определённом смысле субъектом онтологии. Неклассическая гносеология описывает познавательные ситуации, когда знание не описывают объект, существующий сам по себе. 
<br>Неклассическая гносеология характеризуется следующими новациями: 
<br>1. Отказ от познания как отражение реальности. 2. Познание – один из возможных способов освоения человеком мира культуры как культуротворчества и др. 
<br>Таким образом, происходит отказ от классического принципа объективности, то есть описания и объяснения свойств объекта, существующего «сам по себе». Меняется методология испытания природы.

'''

ans_35 = '''
35.	Теория познания
<br>  Любая чувственная форма окрашена рациональным моментом, и наоборот, всякое абстрактное теоретическое понятие в конечном итоге имеет основание в практической деятельности человека и основано на данных органов чувств. 
<br> Формы чувственного познания: 
<br>1. Ощущение – это отражение отдельных сторон, свойств объекта. Ощущение является исходным пунктом познавательного процесса и представляет собой непосредственную связь человека с внешним миром. 
<br>2. Восприятие – более высокая форма познания, которая представляет собой отражение предмета в целом. 
<br>3. Представление – высшая форма, которая характеризуется возможностью воспроизведения ранее воспринимавшихся объектов. Особенность его состоит в том, что оно содержит элемент обобщения и тем самым сближается с рациональной формой познания. Рациональное познание называется абстрактным мышлением. Рациональное познание характеризуется двумя основными свойствами: основывается на абстрактных понятиях и отражает сущность. 
<br>Формы рационального познания: 
<br>1. Понятие – есть определённая мысль, в которой зафиксированы общие свойства объекта. Например: дерево, дом.
<br>2. Суждение – это определенная мысль, в которой что-либо отрицается или утверждается. 
<br>3. Умозаключение – это вывод из двух или более суждений нового суждения. Существует два вида умозаключения: индукция и дедукция. Индукция – умозаключение, направленное от частных высказываний к общим. Дедукция – умозаключение, направленное от общего к частному. В истории философии сформировался сенсуализм – философское направление, основным методом познания является чувственное познание. С ним связано такое направление как эмпиризм (Ф. Бэкон, Дж. Локк) – философское течение, которое абсолютизирует роль опытного, экспериментального исследования мира. Рационализм (Декарт,Лейбниц) абсолютизирует роль логического, абстрактного мышления и является противоположностью сенсуализму и эмпиризму. 

'''

ans_36 = '''
36.	Когнитивная психология и логика
<br>Когнитивная психология - Одно из направлений преимущественно американской психологии, возникшее в начале 60-х гг. 
<br>Когнитивная психология выдвигает следующие идеи.
<br>1. Основные объекты изучения - познавательные процессы: память, речь и ее психологические аспекты, восприятие, внимание, мышление и воображение, а также эмоциональная и волевая сферы личности.
<br>2. Методы исследования - хронометрические методики, основанные на точной регистрации времени ответа на поставленную задачу или реакции на сигнал. Отвергаются интроспективные методы, так как не обладают той точностью, которая необходима для изучения указанных объектов.
<br>3. Все формы человеческого познания и познавательной активности схожи с операциями ЭВМ и имеют следующие характеристики:
<br>- строгую последовательность в сборе и переработке информации;
<br>- уроеневую организацию в переработке, хранении и использовании информационных блоков;
<br>- избирательность, определяемую опытом познающего субъекта;
<br>- зависимость от среды - от предметов физического мира, культурной и социальной среды;
<br>- активность и переменчивость, выражающиеся в постоянной корректировке образов при взаимодействии с окружающей средой.
<br>Логика – наука о законах и формах человеческого мышления, рассматриваемого как средство познания окружающей действительности.
<br>Значение логики состоит в следующем:
<br>1) логика выступает важнейшим средством формирования убеждений. Эти убеждения опираются на доказательные процедуры своего представления и обоснования. Именно в этом плане логика применялась даже средневековыми схоластами, пытавшимися придать христианскому вероучению рациональную форму, что послужило формальной предпосылкой возникновения действительной науки, отказавшейся от теологических подходов;
<br>2) формальная логика применяется в науке и технике. При этом техническими приложениями формальной логики являются: исчисление высказываний и исчисление предикатов. Без исчисления предикатов не могли появиться искусственные информационные языки, основа современной компьютерной техники.;
<br>3) традиционная формальная логика остается важнейшим средством в сфере всех видов образования. Она является основой организации всех видов знания для его подачи в процессе обучения;
<br>4) логика является важнейшим и незаменимым инструментом развития культуры. 
 

'''

ans_37 = '''
37.	Концепция истины
<br>Истина – правильное, адекватное отражение предметов и явлений действительности познающим субъектом, воспроизводящее их так, как они существуют вне и независимо от сознания; объективное содержание человеческого познания.
<br>Различные трактовки истины:
<br>1) Прагматическая концепция: истина это то, что практически полезно.
<br>2) Концепция конвенциализма: истинно то, что сответствует мнению большинства. (однако, в истории науки первооткрыватели, отстаивая истину, часто были в одиночестве).
<br>3) Декарт, Спиноза, Лейбниц: критерий истины ясность и отчетливость мыслимого, т.е. истина то, что не вызывает сомнений. 
<br>4) Платон, Аристотель: Истина есть соответствие мыслей действительности (классическая концепция истины). Платон: "Мир идей истина".
<br>5) Когерентная концепция: Данное утверждение истина, если оно получено по определенным логическим правилам из других предположений, ранее признанных истинными.
<br>6) Корреспондентская теория: Истинным являются утверждения, которые соответствуют внешней действительности. 
<br>7) Кант: Критерий истины чувственное восприятие.
<br>8) Диалектический материализм (Маркс, Лении): Выделяются четыре момента в познавательном действии, которые влияют на истину: 1) объективная реальность; 2) предмет познания; 3) познающий субъект; 4) совокупность логических утверждений. 
<br>Атрибуты истины: 
<br>1) истина идеальна (истинен не предмет, а мысль. Истина сфера сознания); 2) истина объективна (не зависит от субъекта); 3) истина парадоксальна (она раскрывает суть вещи, а не кажущиеся характеристики, она содержит относительные и абсолютные моменты); 4) истина конкретна; 5) социальность (накопление истин в жизни людей); 6) истина совокупность единства и многообразия; 7) экзистенциальность (научная истина объективна, обоснована, а истина жизни имеет субъективный оттенок)
<br>Истина основная часть знания, знание составная часть информации.
 

'''

ans_38 = '''
38.	Философия науки
<br>Наука – это сфера деятельности людей, основной функцией которой является выработка, систематизация, проверка объективных знаний о действительности.
<br>Наука появилась в Древней Греции, ее родоначальниками считаются Аристотель, Архимед, Евклид и др. 
<br>С точки зрения философии в науке различают два уровня исследования:
<br>– эмпирический (направлен непосредственно на изучаемый объект и реализуется с помощью эксперимента и наблюдения);
<br>– теоретический (концентрируется вокруг обобщающих идей, законов, гипотез, принципов). 
<br>1. Эмпирический способ исследования.
<br>Эксперимент является основным способом эмпирического исследования. Эксперимент – это испытание явлений, которые изучаются в контролируемых и управляемых условиях.
<br>Составляющие эксперимента:
<br>– экспериментатор;
<br>– изучаемое явление;
<br>– приборы.
<br>Другой способ эмпирического познания – наблюдение. 
<br>2. Теоретический способ исследования. Теорией называется система понятий, законов и принципов, позволяющая описать и объяснить не который класс явлений. 
<br>В разное время роль науки была неодинакова, но значение ее понималось уже в глубокой древности. В Античности наука являлась результатом происшедшего разделения умственного и физического труда. В виде самостоятельной формы общественного сознания она стала функционировать начиная с эпохи эллинизма, когда целостная культура Античности начала разделяться на отдельные виды и формы духовной деятельности. Появление собственно научных, обособленных и от философии, и от религии форм знания связывается с именем Аристотеля, заложившего первоначальные основы классификации различных знаний. В Средневековье также происходил процесс развития знания, хотя порой и в скрытой форме, как, например, химия (химическое мышление) в форме алхимии.
<br>Феодальное общество с его капитализмом поставило такие практические проблемы, которые могли быть разрешены уже только научно: производство достигало масштабов, делавших необходимым применение механики, математики и других наук. Наука стала духовным содержанием производительных сил, ее достижения воплощались в технических нововведениях. 
 

'''

ans_39 = '''
<br>39.	Структура науки
<br>Наука – это сфера деятельности людей, основной функцией которой является выработка, систематизация, проверка объективных знаний о действительности.
<br>Структура научного познания (В.С. Степин): 
<br>1) факты, 2) результаты их теоретического обобщения в понятиях и других абстракциях, 3) проблемы и гипотезы, 4) законы, проблемы и теории, 5) философские установки, 6) социокультурные основания, 7) методы, идеалы и нормы научного знания, 8) стиль мышления.
<br>Структура научной теории: 
<br>1) исходные основания – фундаментальные понятия, принципы, законы, уравнения, аксиомы, 2) идеализированный объект, т.е. абстрактная модель изучаемого явления («абсолютно черное тело», идеальный газ), 3) логика теории, нацеленная на прояснение структуры и изменение знания, 4) совокупность законов и универсалий, выведенных из основоположений теории.
<br>Функции научной теории: 
<br>1) Синтетическая функция – объединение отдельных достоверных знаний в единую, целостную систему. 2) Объяснительная функция, выявляющая причинные связи явления. 3) Методологическая функция (на базе теории формируются многообразные методы, способы и приемы исследовательской деятельности). 4) Предсказательная функция – предвидение будущего состояния явления. 5) Практическая функция. Конечное предназначение теории – быть воплощенной в практику. Понимание науки, ее строения и функций способствует формированию адекватного отношения к ней.

'''

ans_40 = '''
<br>40.	Прикладные научные исследования
<br>Прикладные исследования — научные исследования, направленные на практическое решение технических и социальных проблем.
<br>Наука — это сфера человеческой деятельности, функцией которой является выработка и теоретическая систематизация объективных знаний о действительности. Непосредственные цели науки — описание, объяснение и предсказание процессов и явлений действительности, составляющих предмет её изучения на основе открываемых ею законов, то есть в широком смысле — теоретическое отражение действительности.
<br>По своей направленности, по отношению к практике отдельные науки принято подразделять на фундаментальные науки (fundamental science) и прикладные науки (applied science). Задачей фундаментальных наук является познание законов, управляющих поведением и взаимодействием базисных структур природы, общества и мышления. Эти законы и структуры изучаются в «чистом виде», как таковые, безотносительно к их возможному использованию. Непосредственная цель прикладных наук — применение фундаментальных наук для решения не только познавательных, но и социально-практических проблем.
<br>еление исследований на фундаментальные и прикладные достаточно условно, так как отдельные результаты фундаментальных исследований могут иметь непосредственную практическую ценность, а в результате прикладных исследований могут быть получены научные открытия.

'''

ans_41 = '''
<br>41. Фундоментальные научные исследования 
<br>Фундаментальные научное исследования – это экспериментальная или теоретическая деятельность, направленная на получение новых знаний об основных закономерностях строения, функционирования и развития человека, общества, окружающей природной среды. Они направлены на получение новых знаний об основах явлений и наблюдаемых фактов, не связанных непосредственно с практическим применением этих знаний. Конечной целью фундаментальных научных исследований является получение новых научных знаний, выражаемых в виде законов, теорий, гипотез, принципов, направлений исследований и в других формах.
<br>Фундаментальные научные исследования могут быть ориентированными, то есть направленными на решение научных проблем, связанных с практическими приложениями.
<br>Единого определения фундаментального исследования не существует, но можно утверждать, что таковым является исследование, ставящее своей задачей разработку или проверку гипотезы (теории), имеющей общий характер и применимой к определенному классу явлений, процессов или объектов. Такая теория по существу является ответом на вопрос, заданный исследователем Природе: как, почему, с помощью какого механизма и энергетики реализуется данный процесс или явление? С этой точки зрения не может рассматриваться как фундаментальное исследование, содержащее только описательную информацию, даже если при описании использована компьютерная обработка, а само описание названо модным словом "мониторинг"; не является фундаментальным исследованием и работа, успешно расширяющая область применения уже известной методики.
<br> Одним из важнейших признаков фундаментальности является именно гипотеза, положенная в основу исследования.
<br> Основная функция фундаментальных исследований - познавательная; непосредственная цель - сделать выводы о природных законах, имеющих общий характер и закономерное постоянство. Основные признаки фундаментальности вскрытых явлений:
<br> а) концептуальная универсальность,
<br> б) пространственно-временная общность.
  

'''

ans_42 = '''
<br>42 Методология научных исследований
<br>Метод – совокупность правил, приемов и операций практич. или теоретич. освоения действительности. Научный метод служит получению и обоснованию объективно-истинного знания. Применяемые в науке методы выполняют двоякую роль. Во-первых, следование им – необх. условие получения достоверного результата. Во-вторых, они выступают как средство соц. контроля в рамках научного сообщества.История развития науки, свидетельствует о том, что новое в познании рождалось не столько благодаря улучшению психологических качеств отдельных личностей, сколько путем изобретения и совершенствования  методов работы.Характер метода определяется многими факторами: предметом исследования, степенью общности поставленных задач, накопленным опытом, уровнем развития научного знания и т.д.
<br>Методы образуют основу учения, которое называется методологией. Она стремится упорядочить, систематизировать методы, установить пригодность их применения в различных областях, ответить на вопрос о том, какого рода условия, средства и действия являются необходимыми и достаточными, чтобы реализовать определенные научные цели и, в конечном счете, получить новое объективно-истинное и обоснованное знание. Поэтому методология не ограничивает себя лишь исследованием методов. Она вовлекает в свою сферу множество производных вопросов: что такое знание, каковы критерии его отличия от заблуждения,  какие формы развития и т.д.
<br>Филос. содержание метода составляют положения онтологии и теории познания, антропологии, логики, этики, эстетики, аксиологии. Ф-я помогает определить правильное направление исследования, т.е. на уровне филос. методологии формируется мотивация научно-исследовательской деятельности.
<br>Концепции, положения которых справедливы по отношению к целому ряду фундаментальных и частных научных дисциплин, составляют базовое знание методов общенаучного характера.В XIX в. математические методы глубоко проникли в самые различные отрасли современного познания и оказались необходимыми в экономике и многих гуманитарных науках (лингвистика, история, социология, политология и др.).
<br>Познавательные методы разделяют на две группы: 1) общелогические – присущие познанию в целом как на обыденном, так и на теоретическом уровне (анализ, синтез, абстрагирование, обобщение, индукция, дедукция, аналогия, моделирование); 2) приводящие к научному познанию. Последние по отношению к опыту делятся на эмпирические (наблюдение, эксперимент, измерение, описание) и теоретические (идеализация, формализация, мысленный эксперимент, гипотетико-дедуктивный метод, метод математической гипотезы).  

'''

ans_43 = '''
<br>43. Наука и инновационная деятельность
<br>Научное познание – это особая форма познавательной деятельности, целью которой является достижение объективного и системно-организованного знания. Научное познание по сравнению с обыденным, художественным, философским и др. представляет собой особую деятельность по получению нового знания. 
<br>   Всякая деятельность включает в себя следующие компоненты – субъект, объект, цель, средства, результат деятельности. 
<br>   Субъект научного познания – профессионально подготовленный человек, обладающий специальными научными знаниями. Объект научного познания – это исследование реальности, знание которое находит применение в будущем. Средства научного познания – материальные объекты, включенные в научное познание (специальные инструменты, измерительные приборы и т.д.). Результат научного познания – истинные знания, отражающие свойства изучаемых объектов. 
<br>Формами научного познания являются гипотеза, факт, закон, теория. Гипотеза – это предположение, которое либо подтверждается, либо опровергается. Факт – это достоверная, объективная информация. Закон – это существенное положение теории. Теория – форма научного знания, дающая целостное представление о закономерностях определенной области действительности. Теория не должна выходить за рамки фактов, иначе она будет иметь фантастический характер. Функции теории – синтетическая, объяснительная, методологическая, предсказательная, практическая. 
<br>   Нормы научной этики редко формулируются в явной форме. Американский социолог Р.К. Мертон предложил нормы науки формулировать, опираясь на принципы 1) универсализма, 2) общности , 3) бескорыстности, 4)организованного скептицизма.
<br>  Научная общественность озабочена возможностью поспешных инноваций, не продуманных в достаточной степени с точки зрения их социальных последствий. В настоящее время ни одна биомедицинская программа, связанная с человеком, не может начать реализацию, если она не прошла экспертизы. 
<br>  Сегодня для всех очевидно, что наука как социальный институт нуждается в постоянном квалифицированном контроле со стороны всего общества в целом. Цели, средства и методы любого исследования должны соответствовать нравственным критериям, иметь в виду не только стремление учёного к успеху, повышению своего научного престижа, но также интересы человечества в глобальном измерении.    

'''

ans_44 = '''
<br>44-45. Структура и философия общества
<br>Несомненно, общество – это системное образование, выделившееся из природы. Значимости природного начала в социальности философы уделяли большое внимание. Сравнивали общество с организмом, не считая, однако, их тождественными, многие мыслители (Платон, Гоббс, Спенсер). Была и крайняя точка зрения в этом отношении, которой придерживалась органическая школа в социологии, имевшая место в конце XIX – начале XX вв. (Шеффле, Бормс и др.). Ее представители пытались объяснить общество как организм биологическими закономерностями: роль кровообращения выполняет торговля, функции головного мозга – правительство и т.п.
<br>Некоторые придерживались антропологического принципа, рассматривая человека и общество как часть природы (Спиноза, Дидро, Гольбах). Оправдан такой вариант социальности, считали они, который соответствует подлинной, высокой, неизменной природе человека. Другие рассматривали общество как результат соглашения индивидов (теория общественного договора – Ж.-Ж. Руссо и др.). Согласно теории соц. действия (Вебер) отношения между людьми в обществе складываются на основе понимания действий друг друга, смысла их намерений и целей. Структурно-функцион. анализ (Спенсер, Парсонс) сосредоточил свое внимание на изучении отношений между классом структур и классом функций, необх. для стабильного существования общества как системы. А постмодернизм (Барт, Делез и др.), настаивая на радикальной плюральности человеч. жизни, вообще исключает из поля своего пристального внимания понятие общества.
<br>Благодаря К. Марксу в XX в. широкое распространение получил деятельностный подход в объяснении социальности, согласно которому в 1-ю очередь трудовая деятельность по производству матер.благ создает каркас общества. Сегодня акценты смещаются на жизнетворчество, где, в отличие от Маркса, на первом плане не большие соц. группы, а индивид как субъект соц. связей. С этих позиций «новая общественность» понимается как результат коммуникации свободных и равных индивидов по установлению норм, правил своего существования.
<br>Возникновение общности между индивидами предполагает наличие сходства между ними, открытости, совместимости, взаимодействия их жизнедеятельности. Задача, стоящая перед общественностью, в том, чтобы создавать постоянно устойчивые многообразные связи, автономные объединения, способные действовать организованно, сплоченно, осознанно.
<br>Важнейшая проблема соц.ф-и – выяснить условия единства, целостности общества, его смысла. Такая постановка задачи в корне отличает соц.ф-ю от других соц. наук, которых в современных условиях великое множество: социология, политология, демография и т.д. Соц. ф-я призвана также выяснить, при каких условиях возможен наиболее плодотворный вариант взаимодействия личности и общества.
<br>Очень важной является проблема закономерностей функционирования и развития общества. Решая эту задачу, соц. ф-я заявляет о себе как о научной области знания. Для этого потребовался подлинный переворот в научном мышлении, который завершился в XX в.Значимый вклад в этот процесс внесли идеи Маркса, в которых утверждалось, что наука об обществе возможна наподобие наук о природе, хотя общество и обладает опред. спецификой: здесь интересы прокладывают себе дорогу через интересы, сознание, деятельность отдельных людей.Трудно не согласиться с известным высказыванием Маркса, что жить в обществе и быть свободным от общества нельзя. 
<br>В совр. условиях подчеркивается важность гражд. общества – такого соц. объединения, кот.ставит своей задачей гарантию прав и свобод личности на основе равенства всех перед законом (идея прав. государства).
<br>Соц. ф-я не только выявляет и объясняет специфические срезы своего предмета, но и занимается поиском наиболее эффективных методов познания.

'''

ans_45 = '''
<br>44-45. Структура и философия общества
<br>Несомненно, общество – это системное образование, выделившееся из природы. Значимости природного начала в социальности философы уделяли большое внимание. Сравнивали общество с организмом, не считая, однако, их тождественными, многие мыслители (Платон, Гоббс, Спенсер). Была и крайняя точка зрения в этом отношении, которой придерживалась органическая школа в социологии, имевшая место в конце XIX – начале XX вв. (Шеффле, Бормс и др.). Ее представители пытались объяснить общество как организм биологическими закономерностями: роль кровообращения выполняет торговля, функции головного мозга – правительство и т.п.
<br>Некоторые придерживались антропологического принципа, рассматривая человека и общество как часть природы (Спиноза, Дидро, Гольбах). Оправдан такой вариант социальности, считали они, который соответствует подлинной, высокой, неизменной природе человека. Другие рассматривали общество как результат соглашения индивидов (теория общественного договора – Ж.-Ж. Руссо и др.). Согласно теории соц. действия (Вебер) отношения между людьми в обществе складываются на основе понимания действий друг друга, смысла их намерений и целей. Структурно-функцион. анализ (Спенсер, Парсонс) сосредоточил свое внимание на изучении отношений между классом структур и классом функций, необх. для стабильного существования общества как системы. А постмодернизм (Барт, Делез и др.), настаивая на радикальной плюральности человеч. жизни, вообще исключает из поля своего пристального внимания понятие общества.
<br>Благодаря К. Марксу в XX в. широкое распространение получил деятельностный подход в объяснении социальности, согласно которому в 1-ю очередь трудовая деятельность по производству матер.благ создает каркас общества. Сегодня акценты смещаются на жизнетворчество, где, в отличие от Маркса, на первом плане не большие соц. группы, а индивид как субъект соц. связей. С этих позиций «новая общественность» понимается как результат коммуникации свободных и равных индивидов по установлению норм, правил своего существования.
<br>Возникновение общности между индивидами предполагает наличие сходства между ними, открытости, совместимости, взаимодействия их жизнедеятельности. Задача, стоящая перед общественностью, в том, чтобы создавать постоянно устойчивые многообразные связи, автономные объединения, способные действовать организованно, сплоченно, осознанно.
<br>Важнейшая проблема соц.ф-и – выяснить условия единства, целостности общества, его смысла. Такая постановка задачи в корне отличает соц.ф-ю от других соц. наук, которых в современных условиях великое множество: социология, политология, демография и т.д. Соц. ф-я призвана также выяснить, при каких условиях возможен наиболее плодотворный вариант взаимодействия личности и общества.
<br>Очень важной является проблема закономерностей функционирования и развития общества. Решая эту задачу, соц. ф-я заявляет о себе как о научной области знания. Для этого потребовался подлинный переворот в научном мышлении, который завершился в XX в.Значимый вклад в этот процесс внесли идеи Маркса, в которых утверждалось, что наука об обществе возможна наподобие наук о природе, хотя общество и обладает опред. спецификой: здесь интересы прокладывают себе дорогу через интересы, сознание, деятельность отдельных людей.Трудно не согласиться с известным высказыванием Маркса, что жить в обществе и быть свободным от общества нельзя. 
<br>В совр. условиях подчеркивается важность гражд. общества – такого соц. объединения, кот.ставит своей задачей гарантию прав и свобод личности на основе равенства всех перед законом (идея прав. государства).
<br>Соц. ф-я не только выявляет и объясняет специфические срезы своего предмета, но и занимается поиском наиболее эффективных методов познания.

'''

ans_46 = '''
<br>46. Экономическая философия
<br>Экономические отношения исторически сформировались в рамках общественного производства, международного разделения труда. Их наличие свидетельствует о том, что производительные силы общества не только преобразуют природу, используют ее в технологических целях, но и активно обсуждают вопросы оптимальной организации труда, собственности, социальной справедливости. 
<br>Производительные силы общества – это человеческий капитал, техника и технологии, природные ресурсы. В человеческом капитале отражаются факторы инновационности, предприимчивости, дисциплины, квалификации, компетентности. В промышленности и сельском хозяйстве важную роль играют производственные отношения, поскольку они связаны с организацией, технологиями, юридическими вопросами форм собственности. 
<br>Экономическая философия изучает выработанные человечеством исторические модели хозяйствования, связанные с либерализмом, либерал-реформизмом, этатизмом. 
<br>Ценности либеральной экономической философии и методологии проповедуют представители шотландской и австрийской экономических школ. Ценности либеральной реформаторской экономической философии распространяют представители американских (США) экономических школ. Этатистская экономическая философия отводит ключевую роль в экономике государству развития. Считается, что без поддержки государства экономика не может решать стратегических задач и быть устойчивой. Важную роль государства в экономике видят и представители либеральной реформаторской философии. Представители же либеральной философии роль государства в экономике отрицают и считают, что там должна доминировать частная инициатива и свободная рыночная конъюнктура. 
<br>В Республике Беларусь с момента создания государства за основу экономических отношений была принята этатистская методология. Она позволила сохранить при поддержке и контроле государства собственность, созданную белорусским народом, модернизировать крупные предприятия и отрасли, агропромышленный комплекс. С 2011 года начался эволюционный переход на методологию 
<br>либеральной реформаторской философии, на основе которой открываются перспективы для частной инициативы, предпринимательства. В связи с этим возрастает значимость менеджмента. 
<br>Философия изучает не только проблемы реальной экономики, но и специфику экономических исследований и экономической теории. 
<br>Методология экономических исследований созвучна научной методологии, поскольку экономисты активно пользуются методами моделирования, измерения, эксперимента, статистическими методами обработки информации, методиками решения задач, компьютерными технологиями. 
<br>Экономическую теорию начали разрабатывать философы начиная с Аристотеля. Затем эту работу продолжили А.Смит, К.Маркс, А.Маршалл, Ф.Хайек. Значительное место в структуре экономической философии занимает этика деловых отношений, этика программной инженерии, конфликтология, философия человеческих потребностей, философия безопасности, философия управления, философия рисков, институциональная философия, философия человеческого капитала, методология управления знаниями. 

'''

ans_47 = '''
<br>47. Философия техники
<br>Техника, наряду с искусством и наукой, является одной из форм задействования человеком внешней природы в процессы деятельности. Это задействование осуществляется в рамках определенных технологических процессов деятельности, используемых человечеством для решения многообразных задач.
<br>Техника, вследствие этого, отражает творческий и научный потенциал человечества, его технологическую и инженерную культуру. Она же является модификацией природных процессов в артефактной форме, форме коммуникаций и инфраструктуры.
<br>Сущность техники определяет опору ф-и техники на: 1) естествознание 2) техникознание; 3) логику и математику 4) гуманитарные науки  5) социально-экономические науки 6) кибернетику 7) экологию.
<br>Т.о., философия техники имеет предметом: технику, технизированную деятельность и технические знания; инженерно-техническое сознание.
<br>Соответственно выделяются сферы: культуры и техники; методологии технических наук и проектирования; инженерной этики.
<br>В центре внимания ф-и техники находятся проблемы сущности и смысла техники. 
<br>Физический износ – это потеря конструктивными элементами технической системы первоначальных физико-химических свойств. Если требование ликвидации не выполняется, то физический износ неизбежно ведет к техногенным катастрофам.
<br>Моральный износ связан с инновационной деятельностью человечества и характеризуется потерей существующими техническими системами технологического соответствия требованиям эргономичности, экологичности, ресурсосбережения, производительности, функциональности.
<br>Модернизация – как реакция на моральный износ с тем, чтобы его не доводить до физического износа.  

'''

ans_48 = '''48. Философия инженерной деятельности
<br>Инженерная деятельность – это технич. деятельность, основ.на регулярном применении научных знаний.
<br>С точки зрения производства инженер должен уметь: 1) эксплуатировать и ремонтировать, проектировать и ликвидировать технологич. процессы и устройства; 2) ставить, разрабатывать, решать задачи, прогнозировать, изобретать и принимать решения по внедрению техники. Понимать значение своей работы и ее последствия как в полезных функциях созданных им технических систем (ТС), так и в нежелательных эффектах.
<br>Полный цикл инженерной деятельности включает изобретательство, конструирование, проектирование, инженерное исследование, технологию и организацию производства, эксплуатацию и оценку техники, ликвидацию устаревшей или вышедшей из строя техники.
<br>Цель проектирования – создание объекта, удовлетворяющего определенным требованиям заказчика, обладающего определенным качеством (структурой).Проектирование начинается с получения информации о состоянии данной области: сведения о технических устройствах, материалах, методах изготовления, компонентах, процессах, состоянии рынка и т.д.
<br>Важной частью инженерной деятельности является техническое знание. Оно обладает спецификой, определяемой задачей объективно отражать реальность с целью повышения эффективности производства
<br>Важным свойством технического знания является нормативность. 
<br>Техническое знание характеризуется и формальными признаками. Наиболее существенный из них – использование графического языка. Чертеж – язык техники, осуществляющий функции хранения и передачи информации на основе единства чувственного и логического познания.
<br>В инженерной деятельности используются идеи:1) возникшие непосредственно в ходе решения данной технической задачи;2) заимствованные из науки и искусства, опыта повседневной жизни.
<br>Для идеи первоначальным материалом выступает условие задачи. В дальнейшем сюда подключаются все имеющиеся и постоянно пополняемые знания и представления, которые уточняются и реорганизуются в соответствии с поставленной целью. 

'''

ans_49 = '''49. Конвергенция естественных и технических наук
<br>На сегодняшний день в задачах, ориентированных на некий синтез естественнонаучного и гуманитарного подходов, первый должен пользоваться безусловным и абсолютным приоритетом. 
<br>Презумпция приоритета естественнонаучного знания в междисциплинарных исследованиях вытекает из лучшей разработанности естественных наук как в фактологическом, так и в методологическом плане. Сегодня гуманитарные науки являются недостаточно развитыми. Так, например, они практически не способны порождать высокие технологии, хотя предмет их исследований предполагает желательность выхода на технологический уровень.
<br>Своего рода модель интеграции наук дает естествознание. В 20 веке интеграция различных естественных наук стала объективно-необходимой для дальнейшего успешного развития каждой из них. И следствием осознания этой необходимости на базе основополагающих идей отдельных наук о природе стало формирование целостного трансдисциплинарного научного направления—современного естествознания. Именно в рамках этого научного направления создана и совершенствуется современная, всеохватывающая, теоретически обоснованная естественнонаучная картина мира.
<br>Все заметнее матемизация конкретных гуманитарных исследований, использование инструментария естественных наук для получения информации, имеющей ценность в гуманитарном знании. Применение количественных методов сегодня не редкость не только в экономике или прикладной социологии, но и в лингвистике, филологии, искусствоведении. 
<br>Характерным становится и использование инструментальных методов и методологических приемов естествознания в некоторых областях истории (физические, химические, биологические, геологические и астрономические методы датирования археологических объектов, исторических событий, идентификация исторических персонажей и др.). Предпринимаются попытки разработать и внедрить в историческую науку подходы, основанные на методах математической статистики и использовании компьютерной техники. Подобные работы вне зависимости от своего конкретного вклада в уточнение исторической хронологии, могут способствовать методологическому развитию социогуманитарного знания. Делаются попытки использования естественнонаучной методики построения теорий для описания социальных явлений.
<br>Вообще же для современной науки все более характерным становится так называемый проблемный подход, заключающийся в том, что для решения конкретной и важной научно-практической проблемы объединяют усилия ученых разных специальностей, создавая смешанные научные коллективы
'''

ans_50 = '''50. Культура и цивилизация
<br>Культура в широком смысле слова – это исторически определ. уровень развития общества, творч. сил и способностей человека, выраж. в типах и формах организации жизни и деят-сти людей, а также в созданных ими матер.и дух. ценностях.Культура в узком смысле слова – это сфера дух.жизни людей. Это понятие употребляется для характеристики опред.Истор. эпохи, конкр. общества, нации, специф. формы деят-сти.
<br>Структура культуры включает в себя:1) деятельность по созданию ценностей;2) матер.и дух. ценности;3) саморазвитие человека, кот. происходит как в процессе создания ценностей, так и в процессе их освоения.
<br>Культура – это специфическая человеческая деятельность, выраженная в материальных и духовных ценностях, а также в степени воплощения духовного опыта человечества в индивидуальном опыте человека.
<br>Особенности культуры:
<br>1. Культура – это небиологич. деятельность человека, выражающая его сущностные силы. Общество не может жертвовать отдельной человеч. единицей ради прогресса общества, иначе возникает возможность тоталитарного общества. 
<br>2. Культура – мера развития человечности. К. Маркс писал: «Только в процессе усвоения культуры естественные человеческие свойства становятся собственно человеческими».
<br>3. Культура выполняет важнейшую адаптационную функцию. Эта функция возникла с первыми наскальными рисунками, с первыми религиозными обрядами.
<br>4. Культура выполняет также образоват., воспитательную, познавательную и регулирующие функции. 
<br>Среда культуры:1) Экономический уровень.2) Социальная развитость.3) Уровень политической организации общества, отражающий меру свободы индивида.4) Духовно-нравственная атмосфера общества.
<br>Определения цивилизации:1) Синоним культуры.2) Общество на определенной стадии развития.3) Уровень развития общества в целом.4) Совокупность технологических достижений человечества.
<br>Согласно теории Энгельса–Моргана можно выделить три этапа развития общества:1) дикость;2) варварство;3) цивилизация.
<br>Этап цивилизации включает в себя:а) рабовладельческое общество; б) аграрно-феодальную цивилизацию;в) цивилизацию буржуазного типа.
<br>В теории Освальда Шпенглера, кот.он изложил в своем знаменитом сочинении «Закат Европы», говорится, что общество проходит два этапа в своем развитии:1) этап восхождения, связ. с нарастанием духовности – это этап «собственно культуры»; 2) этап нисхождения, связ. с новыми технологиями, урбанизацией городов, нарастание противоречий между странами, войнами – этап цивилизации. На этапе цивилизации происходит «окостенение жизни». Не происходит ничего принципиально нового, что ведет к застою и распаду культуры. 
<br>Шпенглер отождествлял культуру с жизнью биологического организма. Все культуры проходят три фазы развития:1) рождение и детство;2) молодость и зрелость;3) старость и закат.Этап цивилизации – это «старость и закат» общества.
<br>Структура цивилизации:1) технологический базис;2) экономический базис;3) гражданское общество;4) вся гамма социокультурного развития общества (семья, нация и т.д.).
<br>Этапы развития цивилизации связаны с социотехнич. революциями:1) Этап перехода от общества собирательного типа, ведущего полудикий образ жизни, к аграрной цивилизации. Этот этап связывают с неолитич. революцией, т.е. переходом к «производящему» обществу. Он вкл. в себя первобытное, рабовладельч., феодальное общество.2) Промышл. революция XVIII в. и становление буржуазного общества привели к индустр. цивилизации.3) 40–50-е гг. XX в.
 

'''

ans_51 = '''51. Философия ценностей
<br>В конце ХIХ века Интерес у философов вызвал и механизм переоценки ценностей. 
<br>В какой-то исторический момент содержание перестает удовлетворять общество и тогда старые ценности наполняются новым содержанием. Весь вопрос заключается только в том, какие должны быть технологии переоценки ценностей. Марксизм видел их в форме социальной революции. 
<br>Прикладные философские разделы сконцентрировались на исследовании 
<br>ценностей и приоритетов. 
<br>Ценностное восприятие отражает готовность субъекта к пониманию значи-
<br>мости тех, или иных предметов и идей. 
<br>Ценностное представление отражает способность субъекта оценивать объ-
<br>ект не только при непосредственном контакте, но и без него, исходя из нормативных установок и абстрактно-образных построений, инженерного опыта. 
<br>Глобальные ценности выполняют функцию объединения человечества в 
<br>решении актуальных проблем. В их число входят ценности гуманизма и экологизма. 
<br>Ценности гуманизма отражают важную роль человека в историческом про-
<br>цессе, его уникальность как разумного существа, индивидуальную неповтори-
<br>мость и творческое своеобразие. 
<br>Ценности экологизма отражают значимость для человечества географической среды, сложившейся на Земле под влиянием живых организмов. 
<br>Региональные ценности общественного сознания специализированы блоком 
<br>экономических и политических интересов народонаселения конкретной территории, стремящегося к объединению усилий в создании более благоприятной среды жизнедеятельности. 
<br>Национальные ценности вытекают из уважительного отношения народона-
<br>селения к истории и традициям какой-либо страны. 
<br>В аспекте исторического времени ценности выступают в форме традиций 
<br>В более узком контексте деятельности ценности делятся на ценности цели, 
<br>инструментальные ценности и предметные ценности. 
<br>Ценности цели актуализируют аспект значимости деятельности и предполагают обоснование последней и ее пропаганду как чего-то самодостаточного и важного. 
<br>Инструментальные ценности указывают на важную проблему выбора 
<br>средств достижения цели и значимость технологической культуры. 
<br>Предметные ценности отражают значимость творчества и труда человека, 
<br>материализовавшегося в предметах культуры. 
 

'''

ans_52 = '''
<br>52. Этика, эстетика, философия права
<br>Этика – это прикладная философская наука, предметом которой являются 
<br>нравственные ценности, мораль, общение, деловые отношения. 
<br>Этика делится на конструктивистскую, нормативную, утилитарную, программную, метафизическую, инженерную, медицинскую, деловую, профессиональную. 
<br>Эстетика – это прикладная философская дисциплина, которая изучает особенности художественного восприятия человечеством мира, практического использования этого видения в архитектуре, дизайне, декоративно-прикладном искусстве, строительстве, городском хозяйстве, конструировании и проектировании. 
<br>Эстетика – это философский анализ такого феномена духовной жизни как 
<br>красота, прекрасное. 
<br>От эстетических переживаний зависит  духовное богатство жизни. 
<br>Эстетика связана с понятиями стиля, жанра, пространства, времени. 
<br>Религоведение – это прикладная философская дисциплина, которая изучает 
<br>духовный мир человечества, его исторические модификации, веру как явление культуры и этическую категорию, религию, мировые религии и их влияние в современном мире, правовые аспекты взаимоотношений религии и государства,прав и обязанностей религиозных и нерелигиозных групп и объединений. 
<br>Жители Беларуси традиционно относят себя к христианству, представлен-
<br>ному четырьмя конфессиями – православной, католической, протестантской, униатской. Духовная культура белорусов характеризуется межконфессиональной веротерпимостью, что является важным фактором национальной безопасности, устойчивости общества. 
<br>Религиозная философия имеет богатые традиции развития и влияния на об-
<br>щественное сознание. На Беларуси эта философия возникла в период средневековья и связана с именами К. Туровского, К. Смолятича, Е. Полоцкой, С. Полоцкого. Эти люди много сделали для православного Просвещения, становления культуры. Понятие веры устойчиво ассоциируется с богом, а появление идеи бога связывается с далеким прошлым, когда человек был бессилен перед природой и, сделав непонятные ему силы природы подобными себе, воплотил в вере в богов свои надежды и чаяния. Вера в таком ракурсе предстает прибежищем слабых и безвольных (вспомним монолог Великого Инквизитора у Достоевского), оправдывающих свое бессилие и возведших его в ранг добродетели («Антихристианин»  Ницше). Однако такое представление о вере является упрощенным, потому как не учитывает, в частности, то, что даже атеист обнаружит в своей душе веру и убежден в том, что каждому человеку вера во что-нибудь необходима. 
<br> Вера, следовательно, занимает другое, не всегда связанное с богом, но очень важное и необходимое место в душе и жизни человека.

'''

ans_53 = '''
53. Философия идентичности
<br>Глобализация приобрела устойчивый характер и основание. Ее экономические преимущества настолько очевидны, что технократия стремится максимально преодолеть фактор национальных границ и тем самым получить доступ к огромному потребительскому и информационному рынку.
<br>Универсализация жизнедеятельности человечества связывает культурно-исторические общности и актуализирует проблему идентичности, в первую очередь цивилизационной идентичности, за которой скрывается фактор самодостаточности социокультурной системы (геополитич., экономич., религиозно-духовной).
<br>Имея необходимый арсенал защитных средств и ресурсов, цивилизационная общность культивирует свою идентичность. 
<br>Проблема цивилизационной идентичности заключается в том, что ее устойчивость испытывают не только внешние факторы в виде той же глобализации, но и внутренние, связанные с неоднозначной цивилизационной сродностью этнических групп, нередко симпатизирующих близлежащим цивилизациям и глобалистским ценностям. В любой цивилизации вследствие этого имеет место этнический сепаратизм.
<br>Если цивилизация утрачивает идентичность, то в ней начинаются процессы распада, связанные с потерей периферии. Ядро цивилизации также может подвергнуться разрушению. Но это пока лишь одно из предположений, поскольку глобализация хронологически занимает небольшой исторический период, и его явно недостаточно для завершения определенных цивилизационных циклов. Пока в научной литературе выражаются лишь опасения по поводу вызванной глобализацией консолидации цивилизаций и связанной с этим эпохой столкновения цивилизаций (Е. Хантингтон).
<br>В структуре идентичности выделяются архетипы, менталитет, характер души народа.
<br>Архетипы – это исторически укоренившиеся в национальном сознании (коллективном бессознательном) образцы мировосприятия, оценки культуры, формы самовыражения и действия, берущие начало в древнейших периодах человечества с учетом локальных демографических процессов, наследования программ культуротворчества. Впервые архетипические структуры общественного сознания выделил и изучил Юнг.
<br>Менталитет – это освоенное и рационализированное нац. сознанием архетипическое подсознание (коллективное бессознательное) в форме нац.мыщления, нац. литературы и изобраз. искусства, кино, телевидения, радио, музыки, хореографии, архитектуры, политической элиты. Термин введен французскими учеными.
<br>Характер души народа – это переплетение благородных, патриотических порывов ради Родины и вредных привычек, подрывающих физические силы народа (пьянство, наркомания, загулы). Большую роль в обуздании темных проявлений  характера народа играет религия, стремящаяся к установлению предпосылок для концентрации характера народа на достойных его предков делах.
 

'''

ans_54 = '''
54. Философия истории
<br>Термин «философия истории» был введен в научный оборот французским просветителем XVIII века Вольтером. Он считал, что историк должен не просто описывать события, излагать их в хронологической последовательности, а философски истолковывать исторический процесс, рефлексировать над его бытием. Чтобы реальнее представить всемирную философскую историю, Гегель всю историографию разделил на три вида: 1) первоначальная история; 2) рефлективная история; 3) философская история. Представители первоначальной истории, к которым немецкий философ причисляет Геродота и Фукидида, налагали исторические события, свидетелями которых были сами. Содержание трудов таких историков пространственно ограничено, так как излагалось то, что их окружаю и что сами видели. Здесь историк «не прибегает к рефлексии потому, что сам духовно сжился с излагаемым им предметом и еще не вышел за его пределы...» Философская история, или философия истории, «означает не что иное как мыслящее рассмотрение ее»3. Исходя из своего основополагающего тезиса о господстве разума в мире, Гегель подчеркивает, что всемирно-исторический процесс совершается разумно. Философия истории, продолжает он, должна рассматривать историю в том виде, в каком она существовала, она должна изучать факты и события и не допускать априорных вымыслов. И чтобы получить истинные знания, разум должен постоянно размышлять, а не бездействовать. По мысли Гегеля, философия истории ищет некие общие принципы в истории, которые присуши всей мировой истории. Главным из этих принципов является разум. В данном случае немецкий мыслитель под разумом понимает закономерности развития исторического процесса. С его точки зрения, все действительное разумно и все разумное действительно. Разумно то, что необходимо и закономерно, а то, что необходимо и закономерно, в то же время действительно.


'''

ans_55 = '''55. Восток и Запад: диалог культуры
<br>В ХХ в. среди филос. наук исключительно важную роль начинает выполнять дисциплина, за кот.закрепляется название «сравнительной ф-и», в рамках кот. изучаются и сопоставляются разнообразные течения мысли Востока и Запада, а заодно ищутся пути и способы их сближения в мировом цивилизационном процессе.
<br>В сравнительной ф-и за приблизительно семь последних десятилетий сталкивались несколько подходов: западноцентризм, востокоцентризм и, наконец, тенденция к восточно-западному синтезу посредством налаживания диалога культур Востока и Запада.
<br>Появление сравнительной ф-и привело к повышению интереса к духовным культурам Востока. Это определялось теми тесными связями, кот.на протяжении нескольких веков существовали между Индией и англ. метрополией вплоть до середины ХХ в., когда Индии удалось добиться гос. независимости. Эти связи, конечно, оказались далеко не простыми. Более того, они были полны острых противоречий и конфликтов.С одной стороны, прогрессивные слои индийского общества сознавали, что благодаря связям с Англией у них появилась возможность приобщиться к передовой культуре Запада и ее достижениям. С другой стороны, они не могли не замечать, что от метрополии исходит тот дух колониального господства, от которого Индии предстоит избавиться ради достижения свободы и процветания страны.
<br>В сравнит.ф-и прогрессивные мыслители Индии увидели средство, с пом. кот. можно было бы вывести на новые рубежи отношения их страны с другими гос-вами, вкл. и Англию, добиться объединения усилий людей Востока и Запада в деле создания условий для лучшей, более гармоничной жизни всего человечества.
<br>Видные философы совр. Индии сегодня озабочены идеей культивирования среди соотечественников тех общечеловеч. ценностей, кот.,по их мнению, позволят индийцам войти в общую семью народов мира в качестве ее полноправного участника. При этом инд. культура не должна утратить своих формировавшихся веками нац. традиций, хотя ей и придется пересмотреть многие прежние стойкие мифы и предрассудки.
<br>В современном движении «нового конфуцианства» на передний план выходят люди, ищущие способы сближения китайской мысли с западными идеями. Причем, это сближение все чаще рассматривается как равноправное сотрудничество двух сторон, как стремление добиться их органического синтеза.
<br>Нельзя не согласиться с мнением, что привлечение системной философии как теоретической базы в наибольшей степени способствовало бы успеху дела новых конфуцианцев.

'''

ans_56 = '''56. Глобализация
<br>    Глобализация отражает усиливающуюся взаимосвязь человечества в финансово-экономической, общественно-политической, культурной, информационной областях.
<br>На уровне экономических представлений речь идет о формировании системы транснационального производства и торговли. Основным субъектом этого процесса являются транснациональные структуры. 
<br>На уровне развития информационно-компьютерных технологий речь идет о возникновении на планете единого коммуникативного пространства.
<br> На уровне развития науки речь идет о формировании практики функционирования международных исследовательских центров инновационной деятельности. 
<br>На уровне образования речь идет о создании образовательных услуг, соответствующих единым международным стандартам.
<br>На уровне охраны окружающей среды (экологии) речь идет о стратегии устойчивого развития, начало которой было положено в рамках ООН в 1992.
<br>Следствием воздействия глобальных изменений на культурную сферу явилось существенное возрастание интереса к проблеме культурной идентичности: многие многонациональные государства пытаются формулировать свою самоидентификацию в терминах культуры и цивилизационных категориях. Носителем современной глобальной культуры является транснациональная группа индивидов, занятых высокоинтеллектуальной творческой профессиональной деятельностью в сфере информационных технологий, науки, образования. Сегодня именно наука становится приоритетной перед технологией и производством.
<br>Феномен глобализации требует осмысления в свете тенденции к экономическому и научно-техническому единству мира, которое угрожает цивилизационному многообразию. Это означает ослабление значимости ценностей национально-государственного уровня, а также усиление фрагментации и сегментации всех сфер общественной жизни. Два наиболее общих сценария развития мирового культурного пространства предполагают либо уменьшение социальной дифференциации и разделение всеми индивидами единых универсальных ценностей, либо рост внутреннего неравенства в развитых странах и подъем этнической идентичности. Развитие множества этнических культур, часто несовместимых с доминирующей национальной культурой, может также привести к возрождению культурного фундаментализма.
 

'''

ans_57 = '''57. Философия безопасности
<br>Ф-я безопасности как самостоят. направление исследований оформилась в конце ХХ в. под влиянием возросшего в деятельности человечества разнообразия рисков и соответствующего стремления общества к устойчивому развитию. В 1992 г. в Рио-де-Жанейро это стремление было оформлено на конференции ООН.
<br>Термин «коэволюция» в научный оборот введен экологами в 60-х гг. ХХ в. и первоначально обозначал взаимное приспособление видов, основанное на взаимовыгоде и паразитизме). В совр. понимании коэволюция понимается как 2-й вариант.
<br>Особую обеспокоенность человечеству доставляют риски техногенного и экономич.происхождения.
<br>Экономическая безопасность – это аспект деятельности, характеризующий важность обеспечения самодостаточности национального государства в условиях глобальных рыночных катаклизмов, связанных с недостатком продовольствия, протекционизмом.
<br>Безопасность – это деятельность, заключающаяся в обеспечении устойч. развития общества и государства путем: 1) мониторинга и минимизации последствий стихийных бедствий, минимизации рисков; 2) высокотехнологичной модернизации аграрного, промышл., оборонит., информационно-образовательного, медицинского комплексов; 3) системотехнической координации оперативного реагирования в процессе устранения последствий природных и техногенных катастроф, потенциальных угроз внешнего и внутреннего характера. 
<br>Соответственно имеющимся возможностям философия безопасности решает задачи: 1) мониторинга (исследования); 2) минимизации последствий стихийных бедствий, угроз, рисков; 3) оптимизации охранных, спасательных, экономических, социально-политических, социальных (медицинских, страховых), информационных, управленческих структур; 4) подготовки кадров; 5) развития материально-технической базы специальных структур; 6) оздоровления, финансовой стабилизации организаций (менеджмент безопасности); 7) совершенствования охраны труда.
 

'''

ans_58 = '''58. Философия устойчивого развития
<br>Устойчивое развитие – развитие человечества, при котором удовлетворение потребностей настоящих поколений осуществляется без ущерба для будущих поколений; управляемое сбалансированное развитие общества, не разрушающего своей природной основы и обеспечивающее непрерывный прогресс цивилизации.
<br>Глобальные проблемы современности – система взаимосвязанных проблем планетарного масштаба, вызванных, прежде всего, техногенной деятельностью человека, и с необходимостью предполагающая их комплексное решение усилиями всего мирового сообщества. Для глобальных проблем характерно: наличие планетарного характера; угроза деградации и гибели всего человечества; необходимость коллективной солидарности государств и общественных движений людей для их разрешения; потребность в быстром реагировании и эффективном решении глобальных проблем и т.д. Глобальный характер проблем породил разное отношение к науке и технике и перспективам их дальнейшего развития, так называемый технократизм и технопессимизм. Представители первого направления отдают приоритет научно-техническому прогрессу и его влиянию на жизнь социума (Т. Веблен, Д. Белл, А. Тоффлер, Д. Несбит и др.). Вторые – природу и масштабы глобальных проблем связывают с научно-техническим прогрессом и предлагают альтернативные проекты (Г. Маркузе, Д. Медоуз, П. Гудмен и др.), к ним присоединяются движение «зеленых», «антиглобалисты» и др.


'''

ans_59 = '''59. Футурология и философия
<br>Что ожидает человечество в будущем, каковы перспективы развития общества и государства – на эти вопросы пытается дать ответы футурология. В широком смысле это общая концепция будущего Земли и человечества, а в узком – отрасль научных знаний, которая изучает тенденции социальных процессов, синоним слов «прогнозирование» и «прогностика». 
<br>В 1960–1970-х гг. XX в. разработаны основные концепции будущего: индустриального общества, постиндустриального общества, информационного общества, «технотронной эры», «процветающего», «организованного», «образованного» и других обществ, теория роста социального развития и формирования новых мировых систем (теория нового мирового порядка), концепция социальных изменений социологии, теория социального действия.
<br>Среди известных футурологов можно назвать имена Т. Парсонса, Д. Белла, Г. Кана, Э. Тоффлера, Т. Джонса, и др.
<br>Исторически в западной футурологии существуют два основных направления исследования будущего. Первое, так называемое пессимистическое, увязывает развитие общества с чередой кризисов и катастроф, которые неизбежно отразятся на человеческом социуме и приведут его к гибели.
<br>Второе направление – оптимистическое. Оно в целом придерживается оптимистической интерпретации будущего при условии проведения государствами всевозможных реформ, причем их необходимость обусловлена самим ходом развития экономики, производства, управления, науки, иными словами всего хозяйства, что не может не отразиться на человеке и обществе.
<br>Футурология не должна быть чем-то вроде научной фантастики или вольной интерпретацией людей, не являющихся учеными-специалистами в какой-либо определенной области исследования. Подходы в ней должны являться строго научными и серьезными, тем самым не выдавая желаемое за действительное.
<br>За основу в футурологических исследованиях берется экономика. Государственное стимулирование экономического роста и научно-технического прогресса рассматривается в качестве основного средства ослабления экономических и социальных потрясений, которые и далее будут сопровождать это развитие. Экономика есть та основа, на которой строится благополучие общества в целом и отдельного человека в частности. Насколько в государстве сохраняется экономический порядок и стабильность, настолько и в обществе смягчается всевозможные социальные проблемы и противоречия.
 

'''

ans_60 = '''60. Философия прогнозирования
<br>Прогноз – это вероятностное, основанное на научных данных, предп-е.
<br>Социальные прогнозы делятся:
<br>– на социально-медицинские (здравоохранение, включая физическую культуру и спорт);
<br>– социально-географические (персп-вы дальн. освоения земной пов-ти, вкл. Мировой океан);
<br>– социально-экологические (перспектива сохранения равновесия между состоянием природной среды и жизнедеятельностью общества);
<br>– социально-космические (перспектива освоения космоса);
<br>– экономические (перспектива развития народного хозяйства, экономических отношений);
<br>– социологические, или социальные в узком смысле (перспектива развития социальных отн.);
<br>– психологические (личность, ее поведение, деятельность);
<br>– демографические (рост, половозрастная структура, миграция населения);
<br>– филолого-этнографические, или лингво-этнологические (развитие языка, письменности и др.);
<br>– архитектурно-градостроительные (социальные аспекты расселения, развития города и деревни, жилища, вообще обитаемой среды);
<br>– образовательно-педагогические (воспитание и обучение, развитие кадров и учреждений в области народного образования и др.);
<br>– культурно-эстетические (материально-техническая база искусства, литературы, всей культуры и т.д.);
<br>– государственно-правовые, или юридические (развитие государства и закон-ва, права и криминологии, вообще правовых отн-й);
<br>– внутриполитические (внутренняя политика своей и другой страны);
<br>– внешнеполитические (внешняя политика своей и другой страны, международные отношения в целом);
<br>– военные (военно-технические, военно-экономические, военно-политические, военно-стратегические, военно-тактические, военно-организационные прогнозы).
<br>При прогнозировании используются методы:
<br>1) анкетирования– опрос населения, экспертов с целью упорядочить, объективизировать субъектные оценки прогнозного характера. 
<br>2) экстраполирования и интерполирования (выявление промежуточного значения между двумя известными моментами процесса) 
<br>3) моделирования – построение поисковых и нормативных моделей с учетом вероятного или желательного изменения прогнозируемого явления на период упреждения прогноза по имеющимся прямым или косвенным данным о масштабах и направлении изменений. Наиболее эффективная прогнозная модель – система уравнений.

'''


def get_ans(num):
    if num == "1":
        return ans_1
    elif num == "2":
        return ans_2
    elif num == "3":
        return ans_3
    elif num == "4":
        return ans_4
    elif num == "5":
        return ans_5
    elif num == "6":
        return ans_6
    elif num == "7":
        return ans_7
    elif num == "7":
        return ans_7
    elif num == "8":
        return ans_8
    elif num == "9":
        return ans_9
    elif num == "10":
        return ans_10
    elif num == "11":
        return ans_11
    elif num == "12":
        return ans_12
    elif num == "13":
        return ans_13
    elif num == "14":
        return ans_14
    elif num == "15":
        return ans_15
    elif num == "16":
        return ans_16
    elif num == "17":
        return ans_17
    elif num == "18":
        return ans_18
    elif num == "19":
        return ans_19
    elif num == "20":
        return ans_20
    elif num == "21":
        return ans_21
    elif num == "22":
        return ans_22
    elif num == "23":
        return ans_23
    elif num == "23":
        return ans_23
    elif num == "24":
        return ans_24
    elif num == "25":
        return ans_25
    elif num == "26":
        return ans_26
    elif num == "27":
        return ans_27
    elif num == "28":
        return ans_28
    elif num == "29":
        return ans_29
    elif num == "30":
        return ans_30
    elif num == "31":
        return ans_31
    elif num == "32":
        return ans_32
    elif num == "33":
        return ans_33
    elif num == "34":
        return ans_34
    elif num == "35":
        return ans_35
    elif num == "36":
        return ans_36
    elif num == "37":
        return ans_37
    elif num == "38":
        return ans_38
    elif num == "39":
        return ans_39
    elif num == "40":
        return ans_40
    elif num == "41":
        return ans_41
    elif num == "42":
        return ans_42
    elif num == "43":
        return ans_43
    elif num == "44":
        return ans_44
    elif num == "45":
        return ans_45
    elif num == "46":
        return ans_46
    elif num == "47":
        return ans_47
    elif num == "48":
        return ans_48
    elif num == "49":
        return ans_49
    elif num == "50":
        return ans_50
    elif num == "51":
        return ans_51
    elif num == "52":
        return ans_52
    elif num == "53":
        return ans_53
    elif num == "54":
        return ans_54
    elif num == "55":
        return ans_55
    elif num == "56":
        return ans_56
    elif num == "57":
        return ans_57
    elif num == "58":
        return ans_58
    elif num == "59":
        return ans_59
    elif num == "60":
        return ans_60
